Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_flash.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; stm32U5Gx_flash.
; ================

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     stm32U5Gx_flash equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// FLASH address definitions
// -------------------------

typedef struct {
    volatile    uint32_t    ACR;
    volatile    uint32_t    RESERVED0;
    volatile    uint32_t    NSKEYR;
    volatile    uint32_t    SECKEYR;
    volatile    uint32_t    OPTKEYR;
    volatile    uint32_t    RESERVED1;
    volatile    uint32_t    PDKEY1R;
    volatile    uint32_t    PDKEY2R;
    volatile    uint32_t    NSSR;
    volatile    uint32_t    SECSR;
    volatile    uint32_t    NSCR;
    volatile    uint32_t    SECCR;
    volatile    uint32_t    ECCR;
    volatile    uint32_t    OPSR;
    volatile    uint32_t    RESERVED2[2];
    volatile    uint32_t    OPTR;
    volatile    uint32_t    NSBOOTADD0R;
    volatile    uint32_t    NSBOOTADD1R;
    volatile    uint32_t    SECBOOTADD0R;
    volatile    uint32_t    SECWM1R1;
    volatile    uint32_t    SECWM1R2;
    volatile    uint32_t    WRP1AR;
    volatile    uint32_t    WRP1BR;
    volatile    uint32_t    SECWM2R1;
    volatile    uint32_t    SECWM2R2;
    volatile    uint32_t    WRP2AR;
    volatile    uint32_t    WRP2BR;
    volatile    uint32_t    OEM1KEYR1;
    volatile    uint32_t    OEM1KEYR2;
    volatile    uint32_t    OEM2KEYR1;
    volatile    uint32_t    OEM2KEYR2;
    volatile    uint32_t    SEC1BBR1;
    volatile    uint32_t    SEC1BBR2;
    volatile    uint32_t    SEC1BBR3;
    volatile    uint32_t    SEC1BBR4;
    volatile    uint32_t    SEC1BBR5;
    volatile    uint32_t    SEC1BBR6;
    volatile    uint32_t    SEC1BBR7;
    volatile    uint32_t    SEC1BBR8;
    volatile    uint32_t    SEC2BBR1;
    volatile    uint32_t    SEC2BBR2;
    volatile    uint32_t    SEC2BBR3;
    volatile    uint32_t    SEC2BBR4;
    volatile    uint32_t    SEC2BBR5;
    volatile    uint32_t    SEC2BBR6;
    volatile    uint32_t    SEC2BBR7;
    volatile    uint32_t    SEC2BBR8;
    volatile    uint32_t    SECHDPCR;
    volatile    uint32_t    PRIVCFGR;
    volatile    uint32_t    RESERVED3[2];
    volatile    uint32_t    PRIV1BBR1;
    volatile    uint32_t    PRIV1BBR2;
    volatile    uint32_t    PRIV1BBR3;
    volatile    uint32_t    PRIV1BBR4;
    volatile    uint32_t    PRIV1BBR5;
    volatile    uint32_t    PRIV1BBR6;
    volatile    uint32_t    PRIV1BBR7;
    volatile    uint32_t    PRIV1BBR8;
    volatile    uint32_t    PRIV2BBR1;
    volatile    uint32_t    PRIV2BBR2;
    volatile    uint32_t    PRIV2BBR3;
    volatile    uint32_t    PRIV2BBR4;
    volatile    uint32_t    PRIV2BBR5;
    volatile    uint32_t    PRIV2BBR6;
    volatile    uint32_t    PRIV2BBR7;
    volatile    uint32_t    PRIV2BBR8;
} FLASH_TypeDef;

#ifdef __cplusplus
#define FLASH_NS    reinterpret_cast<FLASH_TypeDef *>(0x40022000u)
#define FLASH_S     reinterpret_cast<FLASH_TypeDef *>(0x50022000u)

#else
#define FLASH_NS    ((FLASH_TypeDef *)0x40022000u)
#define FLASH_S     ((FLASH_TypeDef *)0x50022000u)
#endif

// ACR Configuration

#define FLASH_ACR_SLEEP_PD                  (0x1u<<14)
#define FLASH_ACR_PDREQ2                    (0x1u<<13)
#define FLASH_ACR_PDREQ1                    (0x1u<<12)
#define FLASH_ACR_LPM                       (0x1u<<11)
#define FLASH_ACR_PRFTEN                    (0x1u<<8)
#define FLASH_ACR_LATENCY                   (0xFu<<0)
#define FLASH_ACR_LATENCY_0                 (0x1u<<0)
#define FLASH_ACR_SLEEP_PD_B_0X0            (0x0u<<14)
#define FLASH_ACR_SLEEP_PD_B_0X1            (0x1u<<14)
#define FLASH_ACR_PDREQ2_B_0X0              (0x0u<<13)
#define FLASH_ACR_PDREQ2_B_0X1              (0x1u<<13)
#define FLASH_ACR_PDREQ1_B_0X0              (0x0u<<12)
#define FLASH_ACR_PDREQ1_B_0X1              (0x1u<<12)
#define FLASH_ACR_LPM_B_0X0                 (0x0u<<11)
#define FLASH_ACR_LPM_B_0X1                 (0x1u<<11)
#define FLASH_ACR_PRFTEN_B_0X0              (0x0u<<8)
#define FLASH_ACR_PRFTEN_B_0X1              (0x1u<<8)
#define FLASH_ACR_LATENCY_B_0X0             (0x0u<<0)
#define FLASH_ACR_LATENCY_B_0X1             (0x1u<<0)
#define FLASH_ACR_LATENCY_B_0X2             (0x2u<<0)
#define FLASH_ACR_LATENCY_B_0XF             (0xFu<<0)

// NSKEYR Configuration

#define FLASH_NSKEYR_NSKEY                  (0xFFFFFFFFu<<0)
#define FLASH_NSKEYR_NSKEY_0                (0x1u<<0)

// SECKEYR Configuration

#define FLASH_SECKEYR_SECKEY                (0xFFFFFFFFu<<0)
#define FLASH_SECKEYR_SECKEY_0              (0x1u<<0)

// OPTKEYR Configuration

#define FLASH_OPTKEYR_OPTKEY                (0xFFFFFFFFu<<0)
#define FLASH_OPTKEYR_OPTKEY_0              (0x1u<<0)

