Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_flash.h
// PDKEY1R Configuration

#define FLASH_PDKEY1R_PDKEY1                (0xFFFFFFFFu<<0)
#define FLASH_PDKEY1R_PDKEY1_0              (0x1u<<0)

// PDKEY2R Configuration

#define FLASH_PDKEY2R_PDKEY2                (0xFFFFFFFFu<<0)
#define FLASH_PDKEY2R_PDKEY2_0              (0x1u<<0)

// NSSR Configuration

#define FLASH_NSSR_PD2                      (0x1u<<21)
#define FLASH_NSSR_PD1                      (0x1u<<20)
#define FLASH_NSSR_OEM2LOCK                 (0x1u<<19)
#define FLASH_NSSR_OEM1LOCK                 (0x1u<<18)
#define FLASH_NSSR_WDW                      (0x1u<<17)
#define FLASH_NSSR_BSY                      (0x1u<<16)
#define FLASH_NSSR_OPTWERR                  (0x1u<<13)
#define FLASH_NSSR_PGSERR                   (0x1u<<7)
#define FLASH_NSSR_SIZERR                   (0x1u<<6)
#define FLASH_NSSR_PGAERR                   (0x1u<<5)
#define FLASH_NSSR_WRPERR                   (0x1u<<4)
#define FLASH_NSSR_PROGERR                  (0x1u<<3)
#define FLASH_NSSR_OPERR                    (0x1u<<1)
#define FLASH_NSSR_EOP                      (0x1u<<0)

// SECSR Configuration

#define FLASH_SECSR_WDW                     (0x1u<<17)
#define FLASH_SECSR_BSY                     (0x1u<<16)
#define FLASH_SECSR_RDERR                   (0x1u<<14)
#define FLASH_SECSR_PGSERR                  (0x1u<<7)
#define FLASH_SECSR_SIZERR                  (0x1u<<6)
#define FLASH_SECSR_PGAERR                  (0x1u<<5)
#define FLASH_SECSR_WRPERR                  (0x1u<<4)
#define FLASH_SECSR_PROGERR                 (0x1u<<3)
#define FLASH_SECSR_OPERR                   (0x1u<<1)
#define FLASH_SECSR_EOP                     (0x1u<<0)

// NSCR Configuration

#define FLASH_NSCR_LOCK                     (0x1u<<31)
#define FLASH_NSCR_OPTLOCK                  (0x1u<<30)
#define FLASH_NSCR_OBL_LAUNCH               (0x1u<<27)
#define FLASH_NSCR_ERRIE                    (0x1u<<25)
#define FLASH_NSCR_EOPIE                    (0x1u<<24)
#define FLASH_NSCR_OPTSTRT                  (0x1u<<17)
#define FLASH_NSCR_STRT                     (0x1u<<16)
#define FLASH_NSCR_MER2                     (0x1u<<15)
#define FLASH_NSCR_BWR                      (0x1u<<14)
#define FLASH_NSCR_BKER                     (0x1u<<11)
#define FLASH_NSCR_PNB                      (0xFFu<<3)
#define FLASH_NSCR_PNB_0                    (0x1u<<3)
#define FLASH_NSCR_MER1                     (0x1u<<2)
#define FLASH_NSCR_PER                      (0x1u<<1)
#define FLASH_NSCR_PG                       (0x1u<<0)
#define FLASH_NSCR_OBL_LAUNCH_B_0X0         (0x0u<<27)
#define FLASH_NSCR_OBL_LAUNCH_B_0X1         (0x1u<<27)
#define FLASH_NSCR_ERRIE_B_0X0              (0x0u<<25)
#define FLASH_NSCR_ERRIE_B_0X1              (0x1u<<25)
#define FLASH_NSCR_EOPIE_B_0X0              (0x0u<<24)
#define FLASH_NSCR_EOPIE_B_0X1              (0x1u<<24)
#define FLASH_NSCR_BKER_B_0X0               (0x0u<<11)
#define FLASH_NSCR_BKER_B_0X1               (0x1u<<11)
#define FLASH_NSCR_PNB_B_0X0                (0x0u<<3)
#define FLASH_NSCR_PNB_B_0X1                (0x1u<<3)
#define FLASH_NSCR_PNB_B_0X7F               (0x7Fu<<3)
#define FLASH_NSCR_PNB_B_0XFF               (0xFFu<<3)
#define FLASH_NSCR_PER_B_0X0                (0x0u<<1)
#define FLASH_NSCR_PER_B_0X1                (0x1u<<1)
#define FLASH_NSCR_PG_B_0X0                 (0x0u<<0)
#define FLASH_NSCR_PG_B_0X1                 (0x1u<<0)

// SECCR Configuration

#define FLASH_SECCR_LOCK                    (0x1u<<31)
#define FLASH_SECCR_INV                     (0x1u<<29)
#define FLASH_SECCR_RDERRIE                 (0x1u<<26)
#define FLASH_SECCR_ERRIE                   (0x1u<<25)
#define FLASH_SECCR_EOPIE                   (0x1u<<24)
#define FLASH_SECCR_STRT                    (0x1u<<16)
#define FLASH_SECCR_MER2                    (0x1u<<15)
#define FLASH_SECCR_BWR                     (0x1u<<14)
#define FLASH_SECCR_BKER                    (0x1u<<11)
#define FLASH_SECCR_PNB                     (0xFFu<<3)
#define FLASH_SECCR_PNB_0                   (0x1u<<3)
#define FLASH_SECCR_MER1                    (0x1u<<2)
#define FLASH_SECCR_PER                     (0x1u<<1)
#define FLASH_SECCR_PG                      (0x1u<<0)
#define FLASH_SECCR_RDERRIE_B_0X0           (0x0u<<26)
#define FLASH_SECCR_RDERRIE_B_0X1           (0x1u<<26)
#define FLASH_SECCR_ERRIE_B_0X0             (0x0u<<25)
#define FLASH_SECCR_ERRIE_B_0X1             (0x1u<<25)
#define FLASH_SECCR_EOPIE_B_0X0             (0x0u<<24)
#define FLASH_SECCR_EOPIE_B_0X1             (0x1u<<24)
#define FLASH_SECCR_BKER_B_0X0              (0x0u<<11)
#define FLASH_SECCR_BKER_B_0X1              (0x1u<<11)
#define FLASH_SECCR_PNB_B_0X0               (0x0u<<3)
#define FLASH_SECCR_PNB_B_0X1               (0x1u<<3)
#define FLASH_SECCR_PNB_B_0X7F              (0x7Fu<<3)
#define FLASH_SECCR_PNB_B_0XFF              (0xFFu<<3)
#define FLASH_SECCR_PER_B_0X0               (0x0u<<1)
#define FLASH_SECCR_PER_B_0X1               (0x1u<<1)
#define FLASH_SECCR_PG_B_0X0                (0x0u<<0)
#define FLASH_SECCR_PG_B_0X1                (0x1u<<0)

// ECCR Configuration

#define FLASH_ECCR_ECCD                     (0x1u<<31)
#define FLASH_ECCR_ECCC                     (0x1u<<30)
#define FLASH_ECCR_ECCIE                    (0x1u<<24)
#define FLASH_ECCR_SYSF_ECC                 (0x1u<<22)
#define FLASH_ECCR_BK_ECC                   (0x1u<<21)
#define FLASH_ECCR_ADDR_ECC                 (0x1FFFFFu<<0)
#define FLASH_ECCR_ADDR_ECC_0               (0x1u<<0)
#define FLASH_ECCR_ECCIE_B_0X0              (0x0u<<24)
#define FLASH_ECCR_ECCIE_B_0X1              (0x1u<<24)
#define FLASH_ECCR_BK_ECC_B_0X0             (0x0u<<21)
#define FLASH_ECCR_BK_ECC_B_0X1             (0x1u<<21)

// OPSR Configuration

#define FLASH_OPSR_CODE_OP                  (0x7u<<29)
#define FLASH_OPSR_CODE_OP_0                (0x1u<<29)
#define FLASH_OPSR_SYSF_OP                  (0x1u<<22)
#define FLASH_OPSR_BK_OP                    (0x1u<<21)
#define FLASH_OPSR_ADDR_OP                  (0x1FFFFFu<<0)
#define FLASH_OPSR_ADDR_OP_0                (0x1u<<0)
#define FLASH_OPSR_CODE_OP_B_0X0            (0x0u<<29)
#define FLASH_OPSR_CODE_OP_B_0X1            (0x1u<<29)
#define FLASH_OPSR_CODE_OP_B_0X2            (0x2u<<29)
#define FLASH_OPSR_CODE_OP_B_0X3            (0x3u<<29)
#define FLASH_OPSR_CODE_OP_B_0X4            (0x4u<<29)
#define FLASH_OPSR_CODE_OP_B_0X5            (0x5u<<29)
#define FLASH_OPSR_CODE_OP_B_0X6            (0x6u<<29)
#define FLASH_OPSR_BK_OP_B_0X0              (0x0u<<21)
#define FLASH_OPSR_BK_OP_B_0X1              (0x1u<<21)

// OPTR Configuration

#define FLASH_OPTR_TZEN                     (0x1u<<31)
#define FLASH_OPTR_IO_VDDIO2_HSLV           (0x1u<<30)
#define FLASH_OPTR_IO_VDD_HSLV              (0x1u<<29)
#define FLASH_OPTR_PA15_PUPEN               (0x1u<<28)
#define FLASH_OPTR_NBOOT0                   (0x1u<<27)
#define FLASH_OPTR_NSWBOOT0                 (0x1u<<26)
#define FLASH_OPTR_SRAM2_RST                (0x1u<<25)
#define FLASH_OPTR_SRAM2_ECC                (0x1u<<24)
#define FLASH_OPTR_SRAM3_ECC                (0x1u<<23)
#define FLASH_OPTR_BKPRAM_ECC               (0x1u<<22)
#define FLASH_OPTR_DUALBANK                 (0x1u<<21)
#define FLASH_OPTR_SWAP_BANK                (0x1u<<20)
#define FLASH_OPTR_WWDG_SW                  (0x1u<<19)
#define FLASH_OPTR_IWDG_STDBY               (0x1u<<18)
#define FLASH_OPTR_IWDG_STOP                (0x1u<<17)
#define FLASH_OPTR_IWDG_SW                  (0x1u<<16)
#define FLASH_OPTR_SRAM1345_RST             (0x1u<<15)
#define FLASH_OPTR_NRST_SHDW                (0x1u<<14)
#define FLASH_OPTR_NRST_STDBY               (0x1u<<13)
#define FLASH_OPTR_NRST_STOP                (0x1u<<12)
#define FLASH_OPTR_BOR_LEV                  (0x7u<<8)
#define FLASH_OPTR_BOR_LEV_0                (0x1u<<8)
#define FLASH_OPTR_RDP                      (0xFFu<<0)
#define FLASH_OPTR_RDP_0                    (0x1u<<0)
#define FLASH_OPTR_TZEN_B_0X0               (0x0u<<31)
#define FLASH_OPTR_TZEN_B_0X1               (0x1u<<31)
#define FLASH_OPTR_IO_VDDIO2_HSLV_B_0X0     (0x0u<<30)
#define FLASH_OPTR_IO_VDDIO2_HSLV_B_0X1     (0x1u<<30)
#define FLASH_OPTR_IO_VDD_HSLV_B_0X0        (0x0u<<29)
#define FLASH_OPTR_IO_VDD_HSLV_B_0X1        (0x1u<<29)
#define FLASH_OPTR_PA15_PUPEN_B_0X0         (0x0u<<28)
#define FLASH_OPTR_PA15_PUPEN_B_0X1         (0x1u<<28)
#define FLASH_OPTR_NBOOT0_B_0X0             (0x0u<<27)
#define FLASH_OPTR_NBOOT0_B_0X1             (0x1u<<27)
#define FLASH_OPTR_NSWBOOT0_B_0X0           (0x0u<<26)
#define FLASH_OPTR_NSWBOOT0_B_0X1           (0x1u<<26)
#define FLASH_OPTR_SRAM2_RST_B_0X0          (0x0u<<25)
#define FLASH_OPTR_SRAM2_RST_B_0X1          (0x1u<<25)
#define FLASH_OPTR_SRAM2_ECC_B_0X0          (0x0u<<24)
#define FLASH_OPTR_SRAM2_ECC_B_0X1          (0x1u<<24)
#define FLASH_OPTR_SRAM3_ECC_B_0X0          (0x0u<<23)
#define FLASH_OPTR_SRAM3_ECC_B_0X1          (0x1u<<23)
#define FLASH_OPTR_BKPRAM_ECC_B_0X0         (0x0u<<22)
#define FLASH_OPTR_BKPRAM_ECC_B_0X1         (0x1u<<22)
#define FLASH_OPTR_DUALBANK_B_0X0           (0x0u<<21)
#define FLASH_OPTR_DUALBANK_B_0X1           (0x1u<<21)
#define FLASH_OPTR_SWAP_BANK_B_0X0          (0x0u<<20)
#define FLASH_OPTR_SWAP_BANK_B_0X1          (0x1u<<20)
#define FLASH_OPTR_WWDG_SW_B_0X0            (0x0u<<19)
#define FLASH_OPTR_WWDG_SW_B_0X1            (0x1u<<19)
#define FLASH_OPTR_IWDG_STDBY_B_0X0         (0x0u<<18)
#define FLASH_OPTR_IWDG_STDBY_B_0X1         (0x1u<<18)
#define FLASH_OPTR_IWDG_STOP_B_0X0          (0x0u<<17)
#define FLASH_OPTR_IWDG_STOP_B_0X1          (0x1u<<17)
#define FLASH_OPTR_IWDG_SW_B_0X0            (0x0u<<16)
#define FLASH_OPTR_IWDG_SW_B_0X1            (0x1u<<16)
#define FLASH_OPTR_SRAM1345_RST_B_0X0       (0x0u<<15)
#define FLASH_OPTR_SRAM1345_RST_B_0X1       (0x1u<<15)
#define FLASH_OPTR_NRST_SHDW_B_0X0          (0x0u<<14)
#define FLASH_OPTR_NRST_SHDW_B_0X1          (0x1u<<14)
#define FLASH_OPTR_NRST_STDBY_B_0X0         (0x0u<<13)
#define FLASH_OPTR_NRST_STDBY_B_0X1         (0x1u<<13)
#define FLASH_OPTR_NRST_STOP_B_0X0          (0x0u<<12)
#define FLASH_OPTR_NRST_STOP_B_0X1          (0x1u<<12)
#define FLASH_OPTR_BOR_LEV_B_0X0            (0x0u<<8)
#define FLASH_OPTR_BOR_LEV_B_0X1            (0x1u<<8)
#define FLASH_OPTR_BOR_LEV_B_0X2            (0x2u<<8)
#define FLASH_OPTR_BOR_LEV_B_0X3            (0x3u<<8)
#define FLASH_OPTR_BOR_LEV_B_0X4            (0x4u<<8)
#define FLASH_OPTR_RDP_B_0XAA               (0xAAu<<0)
#define FLASH_OPTR_RDP_B_0X55               (0x55u<<0)
#define FLASH_OPTR_RDP_B_0XCC               (0xCCu<<0)

// NSBOOTADD0R Configuration

