Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_flash.h
#define FLASH_NSBOOTADD0R_NSBOOTADD0        (0x1FFFFFFu<<7)
#define FLASH_NSBOOTADD0R_NSBOOTADD0_0      (0x1u<<7)

// NSBOOTADD1R Configuration

#define FLASH_NSBOOTADD1R_NSBOOTADD1        (0x1FFFFFFu<<7)
#define FLASH_NSBOOTADD1R_NSBOOTADD1_0      (0x1u<<7)

// SECBOOTADD0R Configuration

#define FLASH_SECBOOTADD0R_SECBOOTADD0      (0x1FFFFFFu<<7)
#define FLASH_SECBOOTADD0R_SECBOOTADD0_0    (0x1u<<7)
#define FLASH_SECBOOTADD0R_BOOT_LOCK        (0x1u<<0)

// SECWM1R1 Configuration

#define FLASH_SECWM1R1_SECWM1_PEND          (0xFFu<<16)
#define FLASH_SECWM1R1_SECWM1_PEND_0        (0x1u<<16)
#define FLASH_SECWM1R1_SECWM1_PSTRT         (0xFFu<<0)
#define FLASH_SECWM1R1_SECWM1_PSTRT_0       (0x1u<<0)

// SECWM1R2 Configuration

#define FLASH_SECWM1R2_HDP1EN               (0x1u<<31)
#define FLASH_SECWM1R2_HDP1_PEND            (0xFFu<<16)
#define FLASH_SECWM1R2_HDP1_PEND_0          (0x1u<<16)
#define FLASH_SECWM1R2_PCROP1EN             (0x1u<<15)
#define FLASH_SECWM1R2_PCROP1_PSTRT         (0xFFu<<0)
#define FLASH_SECWM1R2_PCROP1_PSTRT_0       (0x1u<<0)
#define FLASH_SECWM1R2_HDP1EN_B_0X0         (0x0u<<31)
#define FLASH_SECWM1R2_HDP1EN_B_0X1         (0x1u<<31)
#define FLASH_SECWM1R2_PCROP1EN_B_0X0       (0x0u<<15)
#define FLASH_SECWM1R2_PCROP1EN_B_0X1       (0x1u<<15)

// WRP1AR Configuration

#define FLASH_WRP1AR_UNLOCK                 (0x1u<<31)
#define FLASH_WRP1AR_WRP1A_PEND             (0xFFu<<16)
#define FLASH_WRP1AR_WRP1A_PEND_0           (0x1u<<16)
#define FLASH_WRP1AR_WRP1A_PSTRT            (0xFFu<<0)
#define FLASH_WRP1AR_WRP1A_PSTRT_0          (0x1u<<0)
#define FLASH_WRP1AR_UNLOCK_B_0X0           (0x0u<<31)
#define FLASH_WRP1AR_UNLOCK_B_0X1           (0x1u<<31)

// WRP1BR Configuration

#define FLASH_WRP1BR_UNLOCK                 (0x1u<<31)
#define FLASH_WRP1BR_WRP1B_PEND             (0xFFu<<16)
#define FLASH_WRP1BR_WRP1B_PEND_0           (0x1u<<16)
#define FLASH_WRP1BR_WRP1B_PSTRT            (0xFFu<<0)
#define FLASH_WRP1BR_WRP1B_PSTRT_0          (0x1u<<0)
#define FLASH_WRP1BR_UNLOCK_B_0X0           (0x0u<<31)
#define FLASH_WRP1BR_UNLOCK_B_0X1           (0x1u<<31)

// SECWM2R1 Configuration

#define FLASH_SECWM2R1_SECWM2_PEND          (0xFFu<<16)
#define FLASH_SECWM2R1_SECWM2_PEND_0        (0x1u<<16)
#define FLASH_SECWM2R1_SECWM2_PSTRT         (0xFFu<<0)
#define FLASH_SECWM2R1_SECWM2_PSTRT_0       (0x1u<<0)

// SECWM2R2 Configuration

#define FLASH_SECWM2R2_HDP2EN               (0x1u<<31)
#define FLASH_SECWM2R2_HDP2_PEND            (0xFFu<<16)
#define FLASH_SECWM2R2_HDP2_PEND_0          (0x1u<<16)
#define FLASH_SECWM2R2_PCROP2EN             (0x1u<<15)
#define FLASH_SECWM2R2_PCROP2_PSTRT         (0xFFu<<0)
#define FLASH_SECWM2R2_PCROP2_PSTRT_0       (0x1u<<0)
#define FLASH_SECWM2R2_HDP2EN_B_0X0         (0x0u<<31)
#define FLASH_SECWM2R2_HDP2EN_B_0X1         (0x1u<<31)
#define FLASH_SECWM2R2_PCROP2EN_B_0X0       (0x0u<<15)
#define FLASH_SECWM2R2_PCROP2EN_B_0X1       (0x1u<<15)

// WRP2AR Configuration

#define FLASH_WRP2AR_UNLOCK                 (0x1u<<31)
#define FLASH_WRP2AR_WRP2A_PEND             (0xFFu<<16)
#define FLASH_WRP2AR_WRP2A_PEND_0           (0x1u<<16)
#define FLASH_WRP2AR_WRP2A_PSTRT            (0xFFu<<0)
#define FLASH_WRP2AR_WRP2A_PSTRT_0          (0x1u<<0)
#define FLASH_WRP2AR_UNLOCK_B_0X0           (0x0u<<31)
#define FLASH_WRP2AR_UNLOCK_B_0X1           (0x1u<<31)

// WRP2BR Configuration

#define FLASH_WRP2BR_UNLOCK                 (0x1u<<31)
#define FLASH_WRP2BR_WRP2B_PEND             (0xFFu<<16)
#define FLASH_WRP2BR_WRP2B_PEND_0           (0x1u<<16)
#define FLASH_WRP2BR_WRP2B_PSTRT            (0xFFu<<0)
#define FLASH_WRP2BR_WRP2B_PSTRT_0          (0x1u<<0)
#define FLASH_WRP2BR_UNLOCK_B_0X0           (0x0u<<31)
#define FLASH_WRP2BR_UNLOCK_B_0X1           (0x1u<<31)

// OEM1KEYR1 Configuration

#define FLASH_OEM1KEYR1_OEM1KEY             (0xFFFFFFFFu<<0)
#define FLASH_OEM1KEYR1_OEM1KEY_0           (0x1u<<0)

// OEM1KEYR2 Configuration

#define FLASH_OEM1KEYR2_OEM1KEY             (0xFFFFFFFFu<<0)
#define FLASH_OEM1KEYR2_OEM1KEY_0           (0x1u<<0)

// OEM2KEYR1 Configuration

#define FLASH_OEM2KEYR1_OEM2KEY             (0xFFFFFFFFu<<0)
#define FLASH_OEM2KEYR1_OEM2KEY_0           (0x1u<<0)

// OEM2KEYR2 Configuration

#define FLASH_OEM2KEYR2_OEM2KEY             (0xFFFFFFFFu<<0)
#define FLASH_OEM2KEYR2_OEM2KEY_0           (0x1u<<0)

// SEC1BBR1 Configuration

#define FLASH_SEC1BBR1_SEC1BB31             (0x1u<<31)
#define FLASH_SEC1BBR1_SEC1BB30             (0x1u<<30)
#define FLASH_SEC1BBR1_SEC1BB29             (0x1u<<29)
#define FLASH_SEC1BBR1_SEC1BB28             (0x1u<<28)
#define FLASH_SEC1BBR1_SEC1BB27             (0x1u<<27)
#define FLASH_SEC1BBR1_SEC1BB26             (0x1u<<26)
#define FLASH_SEC1BBR1_SEC1BB25             (0x1u<<25)
#define FLASH_SEC1BBR1_SEC1BB24             (0x1u<<24)
#define FLASH_SEC1BBR1_SEC1BB23             (0x1u<<23)
#define FLASH_SEC1BBR1_SEC1BB22             (0x1u<<22)
#define FLASH_SEC1BBR1_SEC1BB21             (0x1u<<21)
#define FLASH_SEC1BBR1_SEC1BB20             (0x1u<<20)
#define FLASH_SEC1BBR1_SEC1BB19             (0x1u<<19)
#define FLASH_SEC1BBR1_SEC1BB18             (0x1u<<18)
#define FLASH_SEC1BBR1_SEC1BB17             (0x1u<<17)
#define FLASH_SEC1BBR1_SEC1BB16             (0x1u<<16)
#define FLASH_SEC1BBR1_SEC1BB15             (0x1u<<15)
#define FLASH_SEC1BBR1_SEC1BB14             (0x1u<<14)
#define FLASH_SEC1BBR1_SEC1BB13             (0x1u<<13)
#define FLASH_SEC1BBR1_SEC1BB12             (0x1u<<12)
#define FLASH_SEC1BBR1_SEC1BB11             (0x1u<<11)
#define FLASH_SEC1BBR1_SEC1BB10             (0x1u<<10)
#define FLASH_SEC1BBR1_SEC1BB9              (0x1u<<9)
#define FLASH_SEC1BBR1_SEC1BB8              (0x1u<<8)
#define FLASH_SEC1BBR1_SEC1BB7              (0x1u<<7)
#define FLASH_SEC1BBR1_SEC1BB6              (0x1u<<6)
#define FLASH_SEC1BBR1_SEC1BB5              (0x1u<<5)
#define FLASH_SEC1BBR1_SEC1BB4              (0x1u<<4)
#define FLASH_SEC1BBR1_SEC1BB3              (0x1u<<3)
#define FLASH_SEC1BBR1_SEC1BB2              (0x1u<<2)
#define FLASH_SEC1BBR1_SEC1BB1              (0x1u<<1)
#define FLASH_SEC1BBR1_SEC1BB0              (0x1u<<0)

