Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_flash.h
// SEC1BBR2 Configuration

#define FLASH_SEC1BBR2_SEC1BB31             (0x1u<<31)
#define FLASH_SEC1BBR2_SEC1BB30             (0x1u<<30)
#define FLASH_SEC1BBR2_SEC1BB29             (0x1u<<29)
#define FLASH_SEC1BBR2_SEC1BB28             (0x1u<<28)
#define FLASH_SEC1BBR2_SEC1BB27             (0x1u<<27)
#define FLASH_SEC1BBR2_SEC1BB26             (0x1u<<26)
#define FLASH_SEC1BBR2_SEC1BB25             (0x1u<<25)
#define FLASH_SEC1BBR2_SEC1BB24             (0x1u<<24)
#define FLASH_SEC1BBR2_SEC1BB23             (0x1u<<23)
#define FLASH_SEC1BBR2_SEC1BB22             (0x1u<<22)
#define FLASH_SEC1BBR2_SEC1BB21             (0x1u<<21)
#define FLASH_SEC1BBR2_SEC1BB20             (0x1u<<20)
#define FLASH_SEC1BBR2_SEC1BB19             (0x1u<<19)
#define FLASH_SEC1BBR2_SEC1BB18             (0x1u<<18)
#define FLASH_SEC1BBR2_SEC1BB17             (0x1u<<17)
#define FLASH_SEC1BBR2_SEC1BB16             (0x1u<<16)
#define FLASH_SEC1BBR2_SEC1BB15             (0x1u<<15)
#define FLASH_SEC1BBR2_SEC1BB14             (0x1u<<14)
#define FLASH_SEC1BBR2_SEC1BB13             (0x1u<<13)
#define FLASH_SEC1BBR2_SEC1BB12             (0x1u<<12)
#define FLASH_SEC1BBR2_SEC1BB11             (0x1u<<11)
#define FLASH_SEC1BBR2_SEC1BB10             (0x1u<<10)
#define FLASH_SEC1BBR2_SEC1BB9              (0x1u<<9)
#define FLASH_SEC1BBR2_SEC1BB8              (0x1u<<8)
#define FLASH_SEC1BBR2_SEC1BB7              (0x1u<<7)
#define FLASH_SEC1BBR2_SEC1BB6              (0x1u<<6)
#define FLASH_SEC1BBR2_SEC1BB5              (0x1u<<5)
#define FLASH_SEC1BBR2_SEC1BB4              (0x1u<<4)
#define FLASH_SEC1BBR2_SEC1BB3              (0x1u<<3)
#define FLASH_SEC1BBR2_SEC1BB2              (0x1u<<2)
#define FLASH_SEC1BBR2_SEC1BB1              (0x1u<<1)
#define FLASH_SEC1BBR2_SEC1BB0              (0x1u<<0)

// SEC1BBR3 Configuration

#define FLASH_SEC1BBR3_SEC1BB31             (0x1u<<31)
#define FLASH_SEC1BBR3_SEC1BB30             (0x1u<<30)
#define FLASH_SEC1BBR3_SEC1BB29             (0x1u<<29)
#define FLASH_SEC1BBR3_SEC1BB28             (0x1u<<28)
#define FLASH_SEC1BBR3_SEC1BB27             (0x1u<<27)
#define FLASH_SEC1BBR3_SEC1BB26             (0x1u<<26)
#define FLASH_SEC1BBR3_SEC1BB25             (0x1u<<25)
#define FLASH_SEC1BBR3_SEC1BB24             (0x1u<<24)
#define FLASH_SEC1BBR3_SEC1BB23             (0x1u<<23)
#define FLASH_SEC1BBR3_SEC1BB22             (0x1u<<22)
#define FLASH_SEC1BBR3_SEC1BB21             (0x1u<<21)
#define FLASH_SEC1BBR3_SEC1BB20             (0x1u<<20)
#define FLASH_SEC1BBR3_SEC1BB19             (0x1u<<19)
#define FLASH_SEC1BBR3_SEC1BB18             (0x1u<<18)
#define FLASH_SEC1BBR3_SEC1BB17             (0x1u<<17)
#define FLASH_SEC1BBR3_SEC1BB16             (0x1u<<16)
#define FLASH_SEC1BBR3_SEC1BB15             (0x1u<<15)
#define FLASH_SEC1BBR3_SEC1BB14             (0x1u<<14)
#define FLASH_SEC1BBR3_SEC1BB13             (0x1u<<13)
#define FLASH_SEC1BBR3_SEC1BB12             (0x1u<<12)
#define FLASH_SEC1BBR3_SEC1BB11             (0x1u<<11)
#define FLASH_SEC1BBR3_SEC1BB10             (0x1u<<10)
#define FLASH_SEC1BBR3_SEC1BB9              (0x1u<<9)
#define FLASH_SEC1BBR3_SEC1BB8              (0x1u<<8)
#define FLASH_SEC1BBR3_SEC1BB7              (0x1u<<7)
#define FLASH_SEC1BBR3_SEC1BB6              (0x1u<<6)
#define FLASH_SEC1BBR3_SEC1BB5              (0x1u<<5)
#define FLASH_SEC1BBR3_SEC1BB4              (0x1u<<4)
#define FLASH_SEC1BBR3_SEC1BB3              (0x1u<<3)
#define FLASH_SEC1BBR3_SEC1BB2              (0x1u<<2)
#define FLASH_SEC1BBR3_SEC1BB1              (0x1u<<1)
#define FLASH_SEC1BBR3_SEC1BB0              (0x1u<<0)

// SEC1BBR4 Configuration

#define FLASH_SEC1BBR4_SEC1BB31             (0x1u<<31)
#define FLASH_SEC1BBR4_SEC1BB30             (0x1u<<30)
#define FLASH_SEC1BBR4_SEC1BB29             (0x1u<<29)
#define FLASH_SEC1BBR4_SEC1BB28             (0x1u<<28)
#define FLASH_SEC1BBR4_SEC1BB27             (0x1u<<27)
#define FLASH_SEC1BBR4_SEC1BB26             (0x1u<<26)
#define FLASH_SEC1BBR4_SEC1BB25             (0x1u<<25)
#define FLASH_SEC1BBR4_SEC1BB24             (0x1u<<24)
#define FLASH_SEC1BBR4_SEC1BB23             (0x1u<<23)
#define FLASH_SEC1BBR4_SEC1BB22             (0x1u<<22)
#define FLASH_SEC1BBR4_SEC1BB21             (0x1u<<21)
#define FLASH_SEC1BBR4_SEC1BB20             (0x1u<<20)
#define FLASH_SEC1BBR4_SEC1BB19             (0x1u<<19)
#define FLASH_SEC1BBR4_SEC1BB18             (0x1u<<18)
#define FLASH_SEC1BBR4_SEC1BB17             (0x1u<<17)
#define FLASH_SEC1BBR4_SEC1BB16             (0x1u<<16)
#define FLASH_SEC1BBR4_SEC1BB15             (0x1u<<15)
#define FLASH_SEC1BBR4_SEC1BB14             (0x1u<<14)
#define FLASH_SEC1BBR4_SEC1BB13             (0x1u<<13)
#define FLASH_SEC1BBR4_SEC1BB12             (0x1u<<12)
#define FLASH_SEC1BBR4_SEC1BB11             (0x1u<<11)
#define FLASH_SEC1BBR4_SEC1BB10             (0x1u<<10)
#define FLASH_SEC1BBR4_SEC1BB9              (0x1u<<9)
#define FLASH_SEC1BBR4_SEC1BB8              (0x1u<<8)
#define FLASH_SEC1BBR4_SEC1BB7              (0x1u<<7)
#define FLASH_SEC1BBR4_SEC1BB6              (0x1u<<6)
#define FLASH_SEC1BBR4_SEC1BB5              (0x1u<<5)
#define FLASH_SEC1BBR4_SEC1BB4              (0x1u<<4)
#define FLASH_SEC1BBR4_SEC1BB3              (0x1u<<3)
#define FLASH_SEC1BBR4_SEC1BB2              (0x1u<<2)
#define FLASH_SEC1BBR4_SEC1BB1              (0x1u<<1)
#define FLASH_SEC1BBR4_SEC1BB0              (0x1u<<0)

// SEC1BBR5 Configuration

#define FLASH_SEC1BBR5_SEC1BB31             (0x1u<<31)
#define FLASH_SEC1BBR5_SEC1BB30             (0x1u<<30)
#define FLASH_SEC1BBR5_SEC1BB29             (0x1u<<29)
#define FLASH_SEC1BBR5_SEC1BB28             (0x1u<<28)
#define FLASH_SEC1BBR5_SEC1BB27             (0x1u<<27)
#define FLASH_SEC1BBR5_SEC1BB26             (0x1u<<26)
#define FLASH_SEC1BBR5_SEC1BB25             (0x1u<<25)
#define FLASH_SEC1BBR5_SEC1BB24             (0x1u<<24)
#define FLASH_SEC1BBR5_SEC1BB23             (0x1u<<23)
#define FLASH_SEC1BBR5_SEC1BB22             (0x1u<<22)
#define FLASH_SEC1BBR5_SEC1BB21             (0x1u<<21)
#define FLASH_SEC1BBR5_SEC1BB20             (0x1u<<20)
#define FLASH_SEC1BBR5_SEC1BB19             (0x1u<<19)
#define FLASH_SEC1BBR5_SEC1BB18             (0x1u<<18)
#define FLASH_SEC1BBR5_SEC1BB17             (0x1u<<17)
#define FLASH_SEC1BBR5_SEC1BB16             (0x1u<<16)
#define FLASH_SEC1BBR5_SEC1BB15             (0x1u<<15)
#define FLASH_SEC1BBR5_SEC1BB14             (0x1u<<14)
#define FLASH_SEC1BBR5_SEC1BB13             (0x1u<<13)
#define FLASH_SEC1BBR5_SEC1BB12             (0x1u<<12)
#define FLASH_SEC1BBR5_SEC1BB11             (0x1u<<11)
#define FLASH_SEC1BBR5_SEC1BB10             (0x1u<<10)
#define FLASH_SEC1BBR5_SEC1BB9              (0x1u<<9)
#define FLASH_SEC1BBR5_SEC1BB8              (0x1u<<8)
#define FLASH_SEC1BBR5_SEC1BB7              (0x1u<<7)
#define FLASH_SEC1BBR5_SEC1BB6              (0x1u<<6)
#define FLASH_SEC1BBR5_SEC1BB5              (0x1u<<5)
#define FLASH_SEC1BBR5_SEC1BB4              (0x1u<<4)
#define FLASH_SEC1BBR5_SEC1BB3              (0x1u<<3)
#define FLASH_SEC1BBR5_SEC1BB2              (0x1u<<2)
#define FLASH_SEC1BBR5_SEC1BB1              (0x1u<<1)
#define FLASH_SEC1BBR5_SEC1BB0              (0x1u<<0)

// SEC1BBR6 Configuration

#define FLASH_SEC1BBR6_SEC1BB31             (0x1u<<31)
#define FLASH_SEC1BBR6_SEC1BB30             (0x1u<<30)
#define FLASH_SEC1BBR6_SEC1BB29             (0x1u<<29)
#define FLASH_SEC1BBR6_SEC1BB28             (0x1u<<28)
#define FLASH_SEC1BBR6_SEC1BB27             (0x1u<<27)
#define FLASH_SEC1BBR6_SEC1BB26             (0x1u<<26)
#define FLASH_SEC1BBR6_SEC1BB25             (0x1u<<25)
#define FLASH_SEC1BBR6_SEC1BB24             (0x1u<<24)
#define FLASH_SEC1BBR6_SEC1BB23             (0x1u<<23)
#define FLASH_SEC1BBR6_SEC1BB22             (0x1u<<22)
#define FLASH_SEC1BBR6_SEC1BB21             (0x1u<<21)
#define FLASH_SEC1BBR6_SEC1BB20             (0x1u<<20)
#define FLASH_SEC1BBR6_SEC1BB19             (0x1u<<19)
#define FLASH_SEC1BBR6_SEC1BB18             (0x1u<<18)
#define FLASH_SEC1BBR6_SEC1BB17             (0x1u<<17)
#define FLASH_SEC1BBR6_SEC1BB16             (0x1u<<16)
#define FLASH_SEC1BBR6_SEC1BB15             (0x1u<<15)
#define FLASH_SEC1BBR6_SEC1BB14             (0x1u<<14)
#define FLASH_SEC1BBR6_SEC1BB13             (0x1u<<13)
#define FLASH_SEC1BBR6_SEC1BB12             (0x1u<<12)
#define FLASH_SEC1BBR6_SEC1BB11             (0x1u<<11)
#define FLASH_SEC1BBR6_SEC1BB10             (0x1u<<10)
#define FLASH_SEC1BBR6_SEC1BB9              (0x1u<<9)
#define FLASH_SEC1BBR6_SEC1BB8              (0x1u<<8)
#define FLASH_SEC1BBR6_SEC1BB7              (0x1u<<7)
#define FLASH_SEC1BBR6_SEC1BB6              (0x1u<<6)
#define FLASH_SEC1BBR6_SEC1BB5              (0x1u<<5)
#define FLASH_SEC1BBR6_SEC1BB4              (0x1u<<4)
#define FLASH_SEC1BBR6_SEC1BB3              (0x1u<<3)
#define FLASH_SEC1BBR6_SEC1BB2              (0x1u<<2)
#define FLASH_SEC1BBR6_SEC1BB1              (0x1u<<1)
#define FLASH_SEC1BBR6_SEC1BB0              (0x1u<<0)

// SEC1BBR7 Configuration

#define FLASH_SEC1BBR7_SEC1BB31             (0x1u<<31)
#define FLASH_SEC1BBR7_SEC1BB30             (0x1u<<30)
#define FLASH_SEC1BBR7_SEC1BB29             (0x1u<<29)
#define FLASH_SEC1BBR7_SEC1BB28             (0x1u<<28)
#define FLASH_SEC1BBR7_SEC1BB27             (0x1u<<27)
#define FLASH_SEC1BBR7_SEC1BB26             (0x1u<<26)
#define FLASH_SEC1BBR7_SEC1BB25             (0x1u<<25)
#define FLASH_SEC1BBR7_SEC1BB24             (0x1u<<24)
#define FLASH_SEC1BBR7_SEC1BB23             (0x1u<<23)
#define FLASH_SEC1BBR7_SEC1BB22             (0x1u<<22)
#define FLASH_SEC1BBR7_SEC1BB21             (0x1u<<21)
#define FLASH_SEC1BBR7_SEC1BB20             (0x1u<<20)
#define FLASH_SEC1BBR7_SEC1BB19             (0x1u<<19)
#define FLASH_SEC1BBR7_SEC1BB18             (0x1u<<18)
#define FLASH_SEC1BBR7_SEC1BB17             (0x1u<<17)
#define FLASH_SEC1BBR7_SEC1BB16             (0x1u<<16)
#define FLASH_SEC1BBR7_SEC1BB15             (0x1u<<15)
#define FLASH_SEC1BBR7_SEC1BB14             (0x1u<<14)
#define FLASH_SEC1BBR7_SEC1BB13             (0x1u<<13)
#define FLASH_SEC1BBR7_SEC1BB12             (0x1u<<12)
#define FLASH_SEC1BBR7_SEC1BB11             (0x1u<<11)
#define FLASH_SEC1BBR7_SEC1BB10             (0x1u<<10)
#define FLASH_SEC1BBR7_SEC1BB9              (0x1u<<9)
#define FLASH_SEC1BBR7_SEC1BB8              (0x1u<<8)
#define FLASH_SEC1BBR7_SEC1BB7              (0x1u<<7)
#define FLASH_SEC1BBR7_SEC1BB6              (0x1u<<6)
#define FLASH_SEC1BBR7_SEC1BB5              (0x1u<<5)
#define FLASH_SEC1BBR7_SEC1BB4              (0x1u<<4)
#define FLASH_SEC1BBR7_SEC1BB3              (0x1u<<3)
#define FLASH_SEC1BBR7_SEC1BB2              (0x1u<<2)
#define FLASH_SEC1BBR7_SEC1BB1              (0x1u<<1)
#define FLASH_SEC1BBR7_SEC1BB0              (0x1u<<0)

// SEC1BBR8 Configuration

#define FLASH_SEC1BBR8_SEC1BB31             (0x1u<<31)
#define FLASH_SEC1BBR8_SEC1BB30             (0x1u<<30)
#define FLASH_SEC1BBR8_SEC1BB29             (0x1u<<29)
#define FLASH_SEC1BBR8_SEC1BB28             (0x1u<<28)
#define FLASH_SEC1BBR8_SEC1BB27             (0x1u<<27)
#define FLASH_SEC1BBR8_SEC1BB26             (0x1u<<26)
#define FLASH_SEC1BBR8_SEC1BB25             (0x1u<<25)
#define FLASH_SEC1BBR8_SEC1BB24             (0x1u<<24)
#define FLASH_SEC1BBR8_SEC1BB23             (0x1u<<23)
#define FLASH_SEC1BBR8_SEC1BB22             (0x1u<<22)
#define FLASH_SEC1BBR8_SEC1BB21             (0x1u<<21)
#define FLASH_SEC1BBR8_SEC1BB20             (0x1u<<20)
#define FLASH_SEC1BBR8_SEC1BB19             (0x1u<<19)
#define FLASH_SEC1BBR8_SEC1BB18             (0x1u<<18)
#define FLASH_SEC1BBR8_SEC1BB17             (0x1u<<17)
#define FLASH_SEC1BBR8_SEC1BB16             (0x1u<<16)
#define FLASH_SEC1BBR8_SEC1BB15             (0x1u<<15)
#define FLASH_SEC1BBR8_SEC1BB14             (0x1u<<14)
#define FLASH_SEC1BBR8_SEC1BB13             (0x1u<<13)
#define FLASH_SEC1BBR8_SEC1BB12             (0x1u<<12)
#define FLASH_SEC1BBR8_SEC1BB11             (0x1u<<11)
#define FLASH_SEC1BBR8_SEC1BB10             (0x1u<<10)
#define FLASH_SEC1BBR8_SEC1BB9              (0x1u<<9)
#define FLASH_SEC1BBR8_SEC1BB8              (0x1u<<8)
#define FLASH_SEC1BBR8_SEC1BB7              (0x1u<<7)
#define FLASH_SEC1BBR8_SEC1BB6              (0x1u<<6)
#define FLASH_SEC1BBR8_SEC1BB5              (0x1u<<5)
#define FLASH_SEC1BBR8_SEC1BB4              (0x1u<<4)
#define FLASH_SEC1BBR8_SEC1BB3              (0x1u<<3)
#define FLASH_SEC1BBR8_SEC1BB2              (0x1u<<2)
#define FLASH_SEC1BBR8_SEC1BB1              (0x1u<<1)
#define FLASH_SEC1BBR8_SEC1BB0              (0x1u<<0)

