Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_flash.h
// SEC2BBR1 Configuration

#define FLASH_SEC2BBR1_SEC2BB31             (0x1u<<31)
#define FLASH_SEC2BBR1_SEC2BB30             (0x1u<<30)
#define FLASH_SEC2BBR1_SEC2BB29             (0x1u<<29)
#define FLASH_SEC2BBR1_SEC2BB28             (0x1u<<28)
#define FLASH_SEC2BBR1_SEC2BB27             (0x1u<<27)
#define FLASH_SEC2BBR1_SEC2BB26             (0x1u<<26)
#define FLASH_SEC2BBR1_SEC2BB25             (0x1u<<25)
#define FLASH_SEC2BBR1_SEC2BB24             (0x1u<<24)
#define FLASH_SEC2BBR1_SEC2BB23             (0x1u<<23)
#define FLASH_SEC2BBR1_SEC2BB22             (0x1u<<22)
#define FLASH_SEC2BBR1_SEC2BB21             (0x1u<<21)
#define FLASH_SEC2BBR1_SEC2BB20             (0x1u<<20)
#define FLASH_SEC2BBR1_SEC2BB19             (0x1u<<19)
#define FLASH_SEC2BBR1_SEC2BB18             (0x1u<<18)
#define FLASH_SEC2BBR1_SEC2BB17             (0x1u<<17)
#define FLASH_SEC2BBR1_SEC2BB16             (0x1u<<16)
#define FLASH_SEC2BBR1_SEC2BB15             (0x1u<<15)
#define FLASH_SEC2BBR1_SEC2BB14             (0x1u<<14)
#define FLASH_SEC2BBR1_SEC2BB13             (0x1u<<13)
#define FLASH_SEC2BBR1_SEC2BB12             (0x1u<<12)
#define FLASH_SEC2BBR1_SEC2BB11             (0x1u<<11)
#define FLASH_SEC2BBR1_SEC2BB10             (0x1u<<10)
#define FLASH_SEC2BBR1_SEC2BB9              (0x1u<<9)
#define FLASH_SEC2BBR1_SEC2BB8              (0x1u<<8)
#define FLASH_SEC2BBR1_SEC2BB7              (0x1u<<7)
#define FLASH_SEC2BBR1_SEC2BB6              (0x1u<<6)
#define FLASH_SEC2BBR1_SEC2BB5              (0x1u<<5)
#define FLASH_SEC2BBR1_SEC2BB4              (0x1u<<4)
#define FLASH_SEC2BBR1_SEC2BB3              (0x1u<<3)
#define FLASH_SEC2BBR1_SEC2BB2              (0x1u<<2)
#define FLASH_SEC2BBR1_SEC2BB1              (0x1u<<1)
#define FLASH_SEC2BBR1_SEC2BB0              (0x1u<<0)

// SEC2BBR2 Configuration

#define FLASH_SEC2BBR2_SEC2BB31             (0x1u<<31)
#define FLASH_SEC2BBR2_SEC2BB30             (0x1u<<30)
#define FLASH_SEC2BBR2_SEC2BB29             (0x1u<<29)
#define FLASH_SEC2BBR2_SEC2BB28             (0x1u<<28)
#define FLASH_SEC2BBR2_SEC2BB27             (0x1u<<27)
#define FLASH_SEC2BBR2_SEC2BB26             (0x1u<<26)
#define FLASH_SEC2BBR2_SEC2BB25             (0x1u<<25)
#define FLASH_SEC2BBR2_SEC2BB24             (0x1u<<24)
#define FLASH_SEC2BBR2_SEC2BB23             (0x1u<<23)
#define FLASH_SEC2BBR2_SEC2BB22             (0x1u<<22)
#define FLASH_SEC2BBR2_SEC2BB21             (0x1u<<21)
#define FLASH_SEC2BBR2_SEC2BB20             (0x1u<<20)
#define FLASH_SEC2BBR2_SEC2BB19             (0x1u<<19)
#define FLASH_SEC2BBR2_SEC2BB18             (0x1u<<18)
#define FLASH_SEC2BBR2_SEC2BB17             (0x1u<<17)
#define FLASH_SEC2BBR2_SEC2BB16             (0x1u<<16)
#define FLASH_SEC2BBR2_SEC2BB15             (0x1u<<15)
#define FLASH_SEC2BBR2_SEC2BB14             (0x1u<<14)
#define FLASH_SEC2BBR2_SEC2BB13             (0x1u<<13)
#define FLASH_SEC2BBR2_SEC2BB12             (0x1u<<12)
#define FLASH_SEC2BBR2_SEC2BB11             (0x1u<<11)
#define FLASH_SEC2BBR2_SEC2BB10             (0x1u<<10)
#define FLASH_SEC2BBR2_SEC2BB9              (0x1u<<9)
#define FLASH_SEC2BBR2_SEC2BB8              (0x1u<<8)
#define FLASH_SEC2BBR2_SEC2BB7              (0x1u<<7)
#define FLASH_SEC2BBR2_SEC2BB6              (0x1u<<6)
#define FLASH_SEC2BBR2_SEC2BB5              (0x1u<<5)
#define FLASH_SEC2BBR2_SEC2BB4              (0x1u<<4)
#define FLASH_SEC2BBR2_SEC2BB3              (0x1u<<3)
#define FLASH_SEC2BBR2_SEC2BB2              (0x1u<<2)
#define FLASH_SEC2BBR2_SEC2BB1              (0x1u<<1)
#define FLASH_SEC2BBR2_SEC2BB0              (0x1u<<0)

// SEC2BBR3 Configuration

#define FLASH_SEC2BBR3_SEC2BB31             (0x1u<<31)
#define FLASH_SEC2BBR3_SEC2BB30             (0x1u<<30)
#define FLASH_SEC2BBR3_SEC2BB29             (0x1u<<29)
#define FLASH_SEC2BBR3_SEC2BB28             (0x1u<<28)
#define FLASH_SEC2BBR3_SEC2BB27             (0x1u<<27)
#define FLASH_SEC2BBR3_SEC2BB26             (0x1u<<26)
#define FLASH_SEC2BBR3_SEC2BB25             (0x1u<<25)
#define FLASH_SEC2BBR3_SEC2BB24             (0x1u<<24)
#define FLASH_SEC2BBR3_SEC2BB23             (0x1u<<23)
#define FLASH_SEC2BBR3_SEC2BB22             (0x1u<<22)
#define FLASH_SEC2BBR3_SEC2BB21             (0x1u<<21)
#define FLASH_SEC2BBR3_SEC2BB20             (0x1u<<20)
#define FLASH_SEC2BBR3_SEC2BB19             (0x1u<<19)
#define FLASH_SEC2BBR3_SEC2BB18             (0x1u<<18)
#define FLASH_SEC2BBR3_SEC2BB17             (0x1u<<17)
#define FLASH_SEC2BBR3_SEC2BB16             (0x1u<<16)
#define FLASH_SEC2BBR3_SEC2BB15             (0x1u<<15)
#define FLASH_SEC2BBR3_SEC2BB14             (0x1u<<14)
#define FLASH_SEC2BBR3_SEC2BB13             (0x1u<<13)
#define FLASH_SEC2BBR3_SEC2BB12             (0x1u<<12)
#define FLASH_SEC2BBR3_SEC2BB11             (0x1u<<11)
#define FLASH_SEC2BBR3_SEC2BB10             (0x1u<<10)
#define FLASH_SEC2BBR3_SEC2BB9              (0x1u<<9)
#define FLASH_SEC2BBR3_SEC2BB8              (0x1u<<8)
#define FLASH_SEC2BBR3_SEC2BB7              (0x1u<<7)
#define FLASH_SEC2BBR3_SEC2BB6              (0x1u<<6)
#define FLASH_SEC2BBR3_SEC2BB5              (0x1u<<5)
#define FLASH_SEC2BBR3_SEC2BB4              (0x1u<<4)
#define FLASH_SEC2BBR3_SEC2BB3              (0x1u<<3)
#define FLASH_SEC2BBR3_SEC2BB2              (0x1u<<2)
#define FLASH_SEC2BBR3_SEC2BB1              (0x1u<<1)
#define FLASH_SEC2BBR3_SEC2BB0              (0x1u<<0)

// SEC2BBR4 Configuration

#define FLASH_SEC2BBR4_SEC2BB31             (0x1u<<31)
#define FLASH_SEC2BBR4_SEC2BB30             (0x1u<<30)
#define FLASH_SEC2BBR4_SEC2BB29             (0x1u<<29)
#define FLASH_SEC2BBR4_SEC2BB28             (0x1u<<28)
#define FLASH_SEC2BBR4_SEC2BB27             (0x1u<<27)
#define FLASH_SEC2BBR4_SEC2BB26             (0x1u<<26)
#define FLASH_SEC2BBR4_SEC2BB25             (0x1u<<25)
#define FLASH_SEC2BBR4_SEC2BB24             (0x1u<<24)
#define FLASH_SEC2BBR4_SEC2BB23             (0x1u<<23)
#define FLASH_SEC2BBR4_SEC2BB22             (0x1u<<22)
#define FLASH_SEC2BBR4_SEC2BB21             (0x1u<<21)
#define FLASH_SEC2BBR4_SEC2BB20             (0x1u<<20)
#define FLASH_SEC2BBR4_SEC2BB19             (0x1u<<19)
#define FLASH_SEC2BBR4_SEC2BB18             (0x1u<<18)
#define FLASH_SEC2BBR4_SEC2BB17             (0x1u<<17)
#define FLASH_SEC2BBR4_SEC2BB16             (0x1u<<16)
#define FLASH_SEC2BBR4_SEC2BB15             (0x1u<<15)
#define FLASH_SEC2BBR4_SEC2BB14             (0x1u<<14)
#define FLASH_SEC2BBR4_SEC2BB13             (0x1u<<13)
#define FLASH_SEC2BBR4_SEC2BB12             (0x1u<<12)
#define FLASH_SEC2BBR4_SEC2BB11             (0x1u<<11)
#define FLASH_SEC2BBR4_SEC2BB10             (0x1u<<10)
#define FLASH_SEC2BBR4_SEC2BB9              (0x1u<<9)
#define FLASH_SEC2BBR4_SEC2BB8              (0x1u<<8)
#define FLASH_SEC2BBR4_SEC2BB7              (0x1u<<7)
#define FLASH_SEC2BBR4_SEC2BB6              (0x1u<<6)
#define FLASH_SEC2BBR4_SEC2BB5              (0x1u<<5)
#define FLASH_SEC2BBR4_SEC2BB4              (0x1u<<4)
#define FLASH_SEC2BBR4_SEC2BB3              (0x1u<<3)
#define FLASH_SEC2BBR4_SEC2BB2              (0x1u<<2)
#define FLASH_SEC2BBR4_SEC2BB1              (0x1u<<1)
#define FLASH_SEC2BBR4_SEC2BB0              (0x1u<<0)

// SEC2BBR5 Configuration

#define FLASH_SEC2BBR5_SEC2BB31             (0x1u<<31)
#define FLASH_SEC2BBR5_SEC2BB30             (0x1u<<30)
#define FLASH_SEC2BBR5_SEC2BB29             (0x1u<<29)
#define FLASH_SEC2BBR5_SEC2BB28             (0x1u<<28)
#define FLASH_SEC2BBR5_SEC2BB27             (0x1u<<27)
#define FLASH_SEC2BBR5_SEC2BB26             (0x1u<<26)
#define FLASH_SEC2BBR5_SEC2BB25             (0x1u<<25)
#define FLASH_SEC2BBR5_SEC2BB24             (0x1u<<24)
#define FLASH_SEC2BBR5_SEC2BB23             (0x1u<<23)
#define FLASH_SEC2BBR5_SEC2BB22             (0x1u<<22)
#define FLASH_SEC2BBR5_SEC2BB21             (0x1u<<21)
#define FLASH_SEC2BBR5_SEC2BB20             (0x1u<<20)
#define FLASH_SEC2BBR5_SEC2BB19             (0x1u<<19)
#define FLASH_SEC2BBR5_SEC2BB18             (0x1u<<18)
#define FLASH_SEC2BBR5_SEC2BB17             (0x1u<<17)
#define FLASH_SEC2BBR5_SEC2BB16             (0x1u<<16)
#define FLASH_SEC2BBR5_SEC2BB15             (0x1u<<15)
#define FLASH_SEC2BBR5_SEC2BB14             (0x1u<<14)
#define FLASH_SEC2BBR5_SEC2BB13             (0x1u<<13)
#define FLASH_SEC2BBR5_SEC2BB12             (0x1u<<12)
#define FLASH_SEC2BBR5_SEC2BB11             (0x1u<<11)
#define FLASH_SEC2BBR5_SEC2BB10             (0x1u<<10)
#define FLASH_SEC2BBR5_SEC2BB9              (0x1u<<9)
#define FLASH_SEC2BBR5_SEC2BB8              (0x1u<<8)
#define FLASH_SEC2BBR5_SEC2BB7              (0x1u<<7)
#define FLASH_SEC2BBR5_SEC2BB6              (0x1u<<6)
#define FLASH_SEC2BBR5_SEC2BB5              (0x1u<<5)
#define FLASH_SEC2BBR5_SEC2BB4              (0x1u<<4)
#define FLASH_SEC2BBR5_SEC2BB3              (0x1u<<3)
#define FLASH_SEC2BBR5_SEC2BB2              (0x1u<<2)
#define FLASH_SEC2BBR5_SEC2BB1              (0x1u<<1)
#define FLASH_SEC2BBR5_SEC2BB0              (0x1u<<0)

// SEC2BBR6 Configuration

#define FLASH_SEC2BBR6_SEC2BB31             (0x1u<<31)
#define FLASH_SEC2BBR6_SEC2BB30             (0x1u<<30)
#define FLASH_SEC2BBR6_SEC2BB29             (0x1u<<29)
#define FLASH_SEC2BBR6_SEC2BB28             (0x1u<<28)
#define FLASH_SEC2BBR6_SEC2BB27             (0x1u<<27)
#define FLASH_SEC2BBR6_SEC2BB26             (0x1u<<26)
#define FLASH_SEC2BBR6_SEC2BB25             (0x1u<<25)
#define FLASH_SEC2BBR6_SEC2BB24             (0x1u<<24)
#define FLASH_SEC2BBR6_SEC2BB23             (0x1u<<23)
#define FLASH_SEC2BBR6_SEC2BB22             (0x1u<<22)
#define FLASH_SEC2BBR6_SEC2BB21             (0x1u<<21)
#define FLASH_SEC2BBR6_SEC2BB20             (0x1u<<20)
#define FLASH_SEC2BBR6_SEC2BB19             (0x1u<<19)
#define FLASH_SEC2BBR6_SEC2BB18             (0x1u<<18)
#define FLASH_SEC2BBR6_SEC2BB17             (0x1u<<17)
#define FLASH_SEC2BBR6_SEC2BB16             (0x1u<<16)
#define FLASH_SEC2BBR6_SEC2BB15             (0x1u<<15)
#define FLASH_SEC2BBR6_SEC2BB14             (0x1u<<14)
#define FLASH_SEC2BBR6_SEC2BB13             (0x1u<<13)
#define FLASH_SEC2BBR6_SEC2BB12             (0x1u<<12)
#define FLASH_SEC2BBR6_SEC2BB11             (0x1u<<11)
#define FLASH_SEC2BBR6_SEC2BB10             (0x1u<<10)
#define FLASH_SEC2BBR6_SEC2BB9              (0x1u<<9)
#define FLASH_SEC2BBR6_SEC2BB8              (0x1u<<8)
#define FLASH_SEC2BBR6_SEC2BB7              (0x1u<<7)
#define FLASH_SEC2BBR6_SEC2BB6              (0x1u<<6)
#define FLASH_SEC2BBR6_SEC2BB5              (0x1u<<5)
#define FLASH_SEC2BBR6_SEC2BB4              (0x1u<<4)
#define FLASH_SEC2BBR6_SEC2BB3              (0x1u<<3)
#define FLASH_SEC2BBR6_SEC2BB2              (0x1u<<2)
#define FLASH_SEC2BBR6_SEC2BB1              (0x1u<<1)
#define FLASH_SEC2BBR6_SEC2BB0              (0x1u<<0)

// SEC2BBR7 Configuration

#define FLASH_SEC2BBR7_SEC2BB31             (0x1u<<31)
#define FLASH_SEC2BBR7_SEC2BB30             (0x1u<<30)
#define FLASH_SEC2BBR7_SEC2BB29             (0x1u<<29)
#define FLASH_SEC2BBR7_SEC2BB28             (0x1u<<28)
#define FLASH_SEC2BBR7_SEC2BB27             (0x1u<<27)
#define FLASH_SEC2BBR7_SEC2BB26             (0x1u<<26)
#define FLASH_SEC2BBR7_SEC2BB25             (0x1u<<25)
#define FLASH_SEC2BBR7_SEC2BB24             (0x1u<<24)
#define FLASH_SEC2BBR7_SEC2BB23             (0x1u<<23)
#define FLASH_SEC2BBR7_SEC2BB22             (0x1u<<22)
#define FLASH_SEC2BBR7_SEC2BB21             (0x1u<<21)
#define FLASH_SEC2BBR7_SEC2BB20             (0x1u<<20)
#define FLASH_SEC2BBR7_SEC2BB19             (0x1u<<19)
#define FLASH_SEC2BBR7_SEC2BB18             (0x1u<<18)
#define FLASH_SEC2BBR7_SEC2BB17             (0x1u<<17)
#define FLASH_SEC2BBR7_SEC2BB16             (0x1u<<16)
#define FLASH_SEC2BBR7_SEC2BB15             (0x1u<<15)
#define FLASH_SEC2BBR7_SEC2BB14             (0x1u<<14)
#define FLASH_SEC2BBR7_SEC2BB13             (0x1u<<13)
#define FLASH_SEC2BBR7_SEC2BB12             (0x1u<<12)
#define FLASH_SEC2BBR7_SEC2BB11             (0x1u<<11)
#define FLASH_SEC2BBR7_SEC2BB10             (0x1u<<10)
#define FLASH_SEC2BBR7_SEC2BB9              (0x1u<<9)
#define FLASH_SEC2BBR7_SEC2BB8              (0x1u<<8)
#define FLASH_SEC2BBR7_SEC2BB7              (0x1u<<7)
#define FLASH_SEC2BBR7_SEC2BB6              (0x1u<<6)
#define FLASH_SEC2BBR7_SEC2BB5              (0x1u<<5)
#define FLASH_SEC2BBR7_SEC2BB4              (0x1u<<4)
#define FLASH_SEC2BBR7_SEC2BB3              (0x1u<<3)
#define FLASH_SEC2BBR7_SEC2BB2              (0x1u<<2)
#define FLASH_SEC2BBR7_SEC2BB1              (0x1u<<1)
#define FLASH_SEC2BBR7_SEC2BB0              (0x1u<<0)

// SEC2BBR8 Configuration

#define FLASH_SEC2BBR8_SEC2BB31             (0x1u<<31)
#define FLASH_SEC2BBR8_SEC2BB30             (0x1u<<30)
#define FLASH_SEC2BBR8_SEC2BB29             (0x1u<<29)
#define FLASH_SEC2BBR8_SEC2BB28             (0x1u<<28)
#define FLASH_SEC2BBR8_SEC2BB27             (0x1u<<27)
#define FLASH_SEC2BBR8_SEC2BB26             (0x1u<<26)
#define FLASH_SEC2BBR8_SEC2BB25             (0x1u<<25)
#define FLASH_SEC2BBR8_SEC2BB24             (0x1u<<24)
#define FLASH_SEC2BBR8_SEC2BB23             (0x1u<<23)
#define FLASH_SEC2BBR8_SEC2BB22             (0x1u<<22)
#define FLASH_SEC2BBR8_SEC2BB21             (0x1u<<21)
#define FLASH_SEC2BBR8_SEC2BB20             (0x1u<<20)
#define FLASH_SEC2BBR8_SEC2BB19             (0x1u<<19)
#define FLASH_SEC2BBR8_SEC2BB18             (0x1u<<18)
#define FLASH_SEC2BBR8_SEC2BB17             (0x1u<<17)
#define FLASH_SEC2BBR8_SEC2BB16             (0x1u<<16)
#define FLASH_SEC2BBR8_SEC2BB15             (0x1u<<15)
#define FLASH_SEC2BBR8_SEC2BB14             (0x1u<<14)
#define FLASH_SEC2BBR8_SEC2BB13             (0x1u<<13)
#define FLASH_SEC2BBR8_SEC2BB12             (0x1u<<12)
#define FLASH_SEC2BBR8_SEC2BB11             (0x1u<<11)
#define FLASH_SEC2BBR8_SEC2BB10             (0x1u<<10)
#define FLASH_SEC2BBR8_SEC2BB9              (0x1u<<9)
#define FLASH_SEC2BBR8_SEC2BB8              (0x1u<<8)
#define FLASH_SEC2BBR8_SEC2BB7              (0x1u<<7)
#define FLASH_SEC2BBR8_SEC2BB6              (0x1u<<6)
#define FLASH_SEC2BBR8_SEC2BB5              (0x1u<<5)
#define FLASH_SEC2BBR8_SEC2BB4              (0x1u<<4)
#define FLASH_SEC2BBR8_SEC2BB3              (0x1u<<3)
#define FLASH_SEC2BBR8_SEC2BB2              (0x1u<<2)
#define FLASH_SEC2BBR8_SEC2BB1              (0x1u<<1)
#define FLASH_SEC2BBR8_SEC2BB0              (0x1u<<0)

