Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_flash.h
// SECHDPCR Configuration

#define FLASH_SECHDPCR_HDP2_ACCDIS          (0x1u<<1)
#define FLASH_SECHDPCR_HDP1_ACCDIS          (0x1u<<0)
#define FLASH_SECHDPCR_HDP2_ACCDIS_B_0X0    (0x0u<<1)
#define FLASH_SECHDPCR_HDP2_ACCDIS_B_0X1    (0x1u<<1)
#define FLASH_SECHDPCR_HDP1_ACCDIS_B_0X0    (0x0u<<0)
#define FLASH_SECHDPCR_HDP1_ACCDIS_B_0X1    (0x1u<<0)

// PRIVCFGR Configuration

#define FLASH_PRIVCFGR_NSPRIV               (0x1u<<1)
#define FLASH_PRIVCFGR_SPRIV                (0x1u<<0)

// PRIV1BBR1 Configuration

#define FLASH_PRIV1BBR1_PRIV1BB31           (0x1u<<31)
#define FLASH_PRIV1BBR1_PRIV1BB30           (0x1u<<30)
#define FLASH_PRIV1BBR1_PRIV1BB29           (0x1u<<29)
#define FLASH_PRIV1BBR1_PRIV1BB28           (0x1u<<28)
#define FLASH_PRIV1BBR1_PRIV1BB27           (0x1u<<27)
#define FLASH_PRIV1BBR1_PRIV1BB26           (0x1u<<26)
#define FLASH_PRIV1BBR1_PRIV1BB25           (0x1u<<25)
#define FLASH_PRIV1BBR1_PRIV1BB24           (0x1u<<24)
#define FLASH_PRIV1BBR1_PRIV1BB23           (0x1u<<23)
#define FLASH_PRIV1BBR1_PRIV1BB22           (0x1u<<22)
#define FLASH_PRIV1BBR1_PRIV1BB21           (0x1u<<21)
#define FLASH_PRIV1BBR1_PRIV1BB20           (0x1u<<20)
#define FLASH_PRIV1BBR1_PRIV1BB19           (0x1u<<19)
#define FLASH_PRIV1BBR1_PRIV1BB18           (0x1u<<18)
#define FLASH_PRIV1BBR1_PRIV1BB17           (0x1u<<17)
#define FLASH_PRIV1BBR1_PRIV1BB16           (0x1u<<16)
#define FLASH_PRIV1BBR1_PRIV1BB15           (0x1u<<15)
#define FLASH_PRIV1BBR1_PRIV1BB14           (0x1u<<14)
#define FLASH_PRIV1BBR1_PRIV1BB13           (0x1u<<13)
#define FLASH_PRIV1BBR1_PRIV1BB12           (0x1u<<12)
#define FLASH_PRIV1BBR1_PRIV1BB11           (0x1u<<11)
#define FLASH_PRIV1BBR1_PRIV1BB10           (0x1u<<10)
#define FLASH_PRIV1BBR1_PRIV1BB9            (0x1u<<9)
#define FLASH_PRIV1BBR1_PRIV1BB8            (0x1u<<8)
#define FLASH_PRIV1BBR1_PRIV1BB7            (0x1u<<7)
#define FLASH_PRIV1BBR1_PRIV1BB6            (0x1u<<6)
#define FLASH_PRIV1BBR1_PRIV1BB5            (0x1u<<5)
#define FLASH_PRIV1BBR1_PRIV1BB4            (0x1u<<4)
#define FLASH_PRIV1BBR1_PRIV1BB3            (0x1u<<3)
#define FLASH_PRIV1BBR1_PRIV1BB2            (0x1u<<2)
#define FLASH_PRIV1BBR1_PRIV1BB1            (0x1u<<1)
#define FLASH_PRIV1BBR1_PRIV1BB0            (0x1u<<0)

// PRIV1BBR2 Configuration

#define FLASH_PRIV1BBR2_PRIV1BB31           (0x1u<<31)
#define FLASH_PRIV1BBR2_PRIV1BB30           (0x1u<<30)
#define FLASH_PRIV1BBR2_PRIV1BB29           (0x1u<<29)
#define FLASH_PRIV1BBR2_PRIV1BB28           (0x1u<<28)
#define FLASH_PRIV1BBR2_PRIV1BB27           (0x1u<<27)
#define FLASH_PRIV1BBR2_PRIV1BB26           (0x1u<<26)
#define FLASH_PRIV1BBR2_PRIV1BB25           (0x1u<<25)
#define FLASH_PRIV1BBR2_PRIV1BB24           (0x1u<<24)
#define FLASH_PRIV1BBR2_PRIV1BB23           (0x1u<<23)
#define FLASH_PRIV1BBR2_PRIV1BB22           (0x1u<<22)
#define FLASH_PRIV1BBR2_PRIV1BB21           (0x1u<<21)
#define FLASH_PRIV1BBR2_PRIV1BB20           (0x1u<<20)
#define FLASH_PRIV1BBR2_PRIV1BB19           (0x1u<<19)
#define FLASH_PRIV1BBR2_PRIV1BB18           (0x1u<<18)
#define FLASH_PRIV1BBR2_PRIV1BB17           (0x1u<<17)
#define FLASH_PRIV1BBR2_PRIV1BB16           (0x1u<<16)
#define FLASH_PRIV1BBR2_PRIV1BB15           (0x1u<<15)
#define FLASH_PRIV1BBR2_PRIV1BB14           (0x1u<<14)
#define FLASH_PRIV1BBR2_PRIV1BB13           (0x1u<<13)
#define FLASH_PRIV1BBR2_PRIV1BB12           (0x1u<<12)
#define FLASH_PRIV1BBR2_PRIV1BB11           (0x1u<<11)
#define FLASH_PRIV1BBR2_PRIV1BB10           (0x1u<<10)
#define FLASH_PRIV1BBR2_PRIV1BB9            (0x1u<<9)
#define FLASH_PRIV1BBR2_PRIV1BB8            (0x1u<<8)
#define FLASH_PRIV1BBR2_PRIV1BB7            (0x1u<<7)
#define FLASH_PRIV1BBR2_PRIV1BB6            (0x1u<<6)
#define FLASH_PRIV1BBR2_PRIV1BB5            (0x1u<<5)
#define FLASH_PRIV1BBR2_PRIV1BB4            (0x1u<<4)
#define FLASH_PRIV1BBR2_PRIV1BB3            (0x1u<<3)
#define FLASH_PRIV1BBR2_PRIV1BB2            (0x1u<<2)
#define FLASH_PRIV1BBR2_PRIV1BB1            (0x1u<<1)
#define FLASH_PRIV1BBR2_PRIV1BB0            (0x1u<<0)

// PRIV1BBR3 Configuration

#define FLASH_PRIV1BBR3_PRIV1BB31           (0x1u<<31)
#define FLASH_PRIV1BBR3_PRIV1BB30           (0x1u<<30)
#define FLASH_PRIV1BBR3_PRIV1BB29           (0x1u<<29)
#define FLASH_PRIV1BBR3_PRIV1BB28           (0x1u<<28)
#define FLASH_PRIV1BBR3_PRIV1BB27           (0x1u<<27)
#define FLASH_PRIV1BBR3_PRIV1BB26           (0x1u<<26)
#define FLASH_PRIV1BBR3_PRIV1BB25           (0x1u<<25)
#define FLASH_PRIV1BBR3_PRIV1BB24           (0x1u<<24)
#define FLASH_PRIV1BBR3_PRIV1BB23           (0x1u<<23)
#define FLASH_PRIV1BBR3_PRIV1BB22           (0x1u<<22)
#define FLASH_PRIV1BBR3_PRIV1BB21           (0x1u<<21)
#define FLASH_PRIV1BBR3_PRIV1BB20           (0x1u<<20)
#define FLASH_PRIV1BBR3_PRIV1BB19           (0x1u<<19)
#define FLASH_PRIV1BBR3_PRIV1BB18           (0x1u<<18)
#define FLASH_PRIV1BBR3_PRIV1BB17           (0x1u<<17)
#define FLASH_PRIV1BBR3_PRIV1BB16           (0x1u<<16)
#define FLASH_PRIV1BBR3_PRIV1BB15           (0x1u<<15)
#define FLASH_PRIV1BBR3_PRIV1BB14           (0x1u<<14)
#define FLASH_PRIV1BBR3_PRIV1BB13           (0x1u<<13)
#define FLASH_PRIV1BBR3_PRIV1BB12           (0x1u<<12)
#define FLASH_PRIV1BBR3_PRIV1BB11           (0x1u<<11)
#define FLASH_PRIV1BBR3_PRIV1BB10           (0x1u<<10)
#define FLASH_PRIV1BBR3_PRIV1BB9            (0x1u<<9)
#define FLASH_PRIV1BBR3_PRIV1BB8            (0x1u<<8)
#define FLASH_PRIV1BBR3_PRIV1BB7            (0x1u<<7)
#define FLASH_PRIV1BBR3_PRIV1BB6            (0x1u<<6)
#define FLASH_PRIV1BBR3_PRIV1BB5            (0x1u<<5)
#define FLASH_PRIV1BBR3_PRIV1BB4            (0x1u<<4)
#define FLASH_PRIV1BBR3_PRIV1BB3            (0x1u<<3)
#define FLASH_PRIV1BBR3_PRIV1BB2            (0x1u<<2)
#define FLASH_PRIV1BBR3_PRIV1BB1            (0x1u<<1)
#define FLASH_PRIV1BBR3_PRIV1BB0            (0x1u<<0)

// PRIV1BBR4 Configuration

#define FLASH_PRIV1BBR4_PRIV1BB31           (0x1u<<31)
#define FLASH_PRIV1BBR4_PRIV1BB30           (0x1u<<30)
#define FLASH_PRIV1BBR4_PRIV1BB29           (0x1u<<29)
#define FLASH_PRIV1BBR4_PRIV1BB28           (0x1u<<28)
#define FLASH_PRIV1BBR4_PRIV1BB27           (0x1u<<27)
#define FLASH_PRIV1BBR4_PRIV1BB26           (0x1u<<26)
#define FLASH_PRIV1BBR4_PRIV1BB25           (0x1u<<25)
#define FLASH_PRIV1BBR4_PRIV1BB24           (0x1u<<24)
#define FLASH_PRIV1BBR4_PRIV1BB23           (0x1u<<23)
#define FLASH_PRIV1BBR4_PRIV1BB22           (0x1u<<22)
#define FLASH_PRIV1BBR4_PRIV1BB21           (0x1u<<21)
#define FLASH_PRIV1BBR4_PRIV1BB20           (0x1u<<20)
#define FLASH_PRIV1BBR4_PRIV1BB19           (0x1u<<19)
#define FLASH_PRIV1BBR4_PRIV1BB18           (0x1u<<18)
#define FLASH_PRIV1BBR4_PRIV1BB17           (0x1u<<17)
#define FLASH_PRIV1BBR4_PRIV1BB16           (0x1u<<16)
#define FLASH_PRIV1BBR4_PRIV1BB15           (0x1u<<15)
#define FLASH_PRIV1BBR4_PRIV1BB14           (0x1u<<14)
#define FLASH_PRIV1BBR4_PRIV1BB13           (0x1u<<13)
#define FLASH_PRIV1BBR4_PRIV1BB12           (0x1u<<12)
#define FLASH_PRIV1BBR4_PRIV1BB11           (0x1u<<11)
#define FLASH_PRIV1BBR4_PRIV1BB10           (0x1u<<10)
#define FLASH_PRIV1BBR4_PRIV1BB9            (0x1u<<9)
#define FLASH_PRIV1BBR4_PRIV1BB8            (0x1u<<8)
#define FLASH_PRIV1BBR4_PRIV1BB7            (0x1u<<7)
#define FLASH_PRIV1BBR4_PRIV1BB6            (0x1u<<6)
#define FLASH_PRIV1BBR4_PRIV1BB5            (0x1u<<5)
#define FLASH_PRIV1BBR4_PRIV1BB4            (0x1u<<4)
#define FLASH_PRIV1BBR4_PRIV1BB3            (0x1u<<3)
#define FLASH_PRIV1BBR4_PRIV1BB2            (0x1u<<2)
#define FLASH_PRIV1BBR4_PRIV1BB1            (0x1u<<1)
#define FLASH_PRIV1BBR4_PRIV1BB0            (0x1u<<0)

// PRIV1BBR5 Configuration

#define FLASH_PRIV1BBR5_PRIV1BB31           (0x1u<<31)
#define FLASH_PRIV1BBR5_PRIV1BB30           (0x1u<<30)
#define FLASH_PRIV1BBR5_PRIV1BB29           (0x1u<<29)
#define FLASH_PRIV1BBR5_PRIV1BB28           (0x1u<<28)
#define FLASH_PRIV1BBR5_PRIV1BB27           (0x1u<<27)
#define FLASH_PRIV1BBR5_PRIV1BB26           (0x1u<<26)
#define FLASH_PRIV1BBR5_PRIV1BB25           (0x1u<<25)
#define FLASH_PRIV1BBR5_PRIV1BB24           (0x1u<<24)
#define FLASH_PRIV1BBR5_PRIV1BB23           (0x1u<<23)
#define FLASH_PRIV1BBR5_PRIV1BB22           (0x1u<<22)
#define FLASH_PRIV1BBR5_PRIV1BB21           (0x1u<<21)
#define FLASH_PRIV1BBR5_PRIV1BB20           (0x1u<<20)
#define FLASH_PRIV1BBR5_PRIV1BB19           (0x1u<<19)
#define FLASH_PRIV1BBR5_PRIV1BB18           (0x1u<<18)
#define FLASH_PRIV1BBR5_PRIV1BB17           (0x1u<<17)
#define FLASH_PRIV1BBR5_PRIV1BB16           (0x1u<<16)
#define FLASH_PRIV1BBR5_PRIV1BB15           (0x1u<<15)
#define FLASH_PRIV1BBR5_PRIV1BB14           (0x1u<<14)
#define FLASH_PRIV1BBR5_PRIV1BB13           (0x1u<<13)
#define FLASH_PRIV1BBR5_PRIV1BB12           (0x1u<<12)
#define FLASH_PRIV1BBR5_PRIV1BB11           (0x1u<<11)
#define FLASH_PRIV1BBR5_PRIV1BB10           (0x1u<<10)
#define FLASH_PRIV1BBR5_PRIV1BB9            (0x1u<<9)
#define FLASH_PRIV1BBR5_PRIV1BB8            (0x1u<<8)
#define FLASH_PRIV1BBR5_PRIV1BB7            (0x1u<<7)
#define FLASH_PRIV1BBR5_PRIV1BB6            (0x1u<<6)
#define FLASH_PRIV1BBR5_PRIV1BB5            (0x1u<<5)
#define FLASH_PRIV1BBR5_PRIV1BB4            (0x1u<<4)
#define FLASH_PRIV1BBR5_PRIV1BB3            (0x1u<<3)
#define FLASH_PRIV1BBR5_PRIV1BB2            (0x1u<<2)
#define FLASH_PRIV1BBR5_PRIV1BB1            (0x1u<<1)
#define FLASH_PRIV1BBR5_PRIV1BB0            (0x1u<<0)

// PRIV1BBR6 Configuration

#define FLASH_PRIV1BBR6_PRIV1BB31           (0x1u<<31)
#define FLASH_PRIV1BBR6_PRIV1BB30           (0x1u<<30)
#define FLASH_PRIV1BBR6_PRIV1BB29           (0x1u<<29)
#define FLASH_PRIV1BBR6_PRIV1BB28           (0x1u<<28)
#define FLASH_PRIV1BBR6_PRIV1BB27           (0x1u<<27)
#define FLASH_PRIV1BBR6_PRIV1BB26           (0x1u<<26)
#define FLASH_PRIV1BBR6_PRIV1BB25           (0x1u<<25)
#define FLASH_PRIV1BBR6_PRIV1BB24           (0x1u<<24)
#define FLASH_PRIV1BBR6_PRIV1BB23           (0x1u<<23)
#define FLASH_PRIV1BBR6_PRIV1BB22           (0x1u<<22)
#define FLASH_PRIV1BBR6_PRIV1BB21           (0x1u<<21)
#define FLASH_PRIV1BBR6_PRIV1BB20           (0x1u<<20)
#define FLASH_PRIV1BBR6_PRIV1BB19           (0x1u<<19)
#define FLASH_PRIV1BBR6_PRIV1BB18           (0x1u<<18)
#define FLASH_PRIV1BBR6_PRIV1BB17           (0x1u<<17)
#define FLASH_PRIV1BBR6_PRIV1BB16           (0x1u<<16)
#define FLASH_PRIV1BBR6_PRIV1BB15           (0x1u<<15)
#define FLASH_PRIV1BBR6_PRIV1BB14           (0x1u<<14)
#define FLASH_PRIV1BBR6_PRIV1BB13           (0x1u<<13)
#define FLASH_PRIV1BBR6_PRIV1BB12           (0x1u<<12)
#define FLASH_PRIV1BBR6_PRIV1BB11           (0x1u<<11)
#define FLASH_PRIV1BBR6_PRIV1BB10           (0x1u<<10)
#define FLASH_PRIV1BBR6_PRIV1BB9            (0x1u<<9)
#define FLASH_PRIV1BBR6_PRIV1BB8            (0x1u<<8)
#define FLASH_PRIV1BBR6_PRIV1BB7            (0x1u<<7)
#define FLASH_PRIV1BBR6_PRIV1BB6            (0x1u<<6)
#define FLASH_PRIV1BBR6_PRIV1BB5            (0x1u<<5)
#define FLASH_PRIV1BBR6_PRIV1BB4            (0x1u<<4)
#define FLASH_PRIV1BBR6_PRIV1BB3            (0x1u<<3)
#define FLASH_PRIV1BBR6_PRIV1BB2            (0x1u<<2)
#define FLASH_PRIV1BBR6_PRIV1BB1            (0x1u<<1)
#define FLASH_PRIV1BBR6_PRIV1BB0            (0x1u<<0)

// PRIV1BBR7 Configuration

#define FLASH_PRIV1BBR7_PRIV1BB31           (0x1u<<31)
#define FLASH_PRIV1BBR7_PRIV1BB30           (0x1u<<30)
#define FLASH_PRIV1BBR7_PRIV1BB29           (0x1u<<29)
#define FLASH_PRIV1BBR7_PRIV1BB28           (0x1u<<28)
#define FLASH_PRIV1BBR7_PRIV1BB27           (0x1u<<27)
#define FLASH_PRIV1BBR7_PRIV1BB26           (0x1u<<26)
#define FLASH_PRIV1BBR7_PRIV1BB25           (0x1u<<25)
#define FLASH_PRIV1BBR7_PRIV1BB24           (0x1u<<24)
#define FLASH_PRIV1BBR7_PRIV1BB23           (0x1u<<23)
#define FLASH_PRIV1BBR7_PRIV1BB22           (0x1u<<22)
#define FLASH_PRIV1BBR7_PRIV1BB21           (0x1u<<21)
#define FLASH_PRIV1BBR7_PRIV1BB20           (0x1u<<20)
#define FLASH_PRIV1BBR7_PRIV1BB19           (0x1u<<19)
#define FLASH_PRIV1BBR7_PRIV1BB18           (0x1u<<18)
#define FLASH_PRIV1BBR7_PRIV1BB17           (0x1u<<17)
#define FLASH_PRIV1BBR7_PRIV1BB16           (0x1u<<16)
#define FLASH_PRIV1BBR7_PRIV1BB15           (0x1u<<15)
#define FLASH_PRIV1BBR7_PRIV1BB14           (0x1u<<14)
#define FLASH_PRIV1BBR7_PRIV1BB13           (0x1u<<13)
#define FLASH_PRIV1BBR7_PRIV1BB12           (0x1u<<12)
#define FLASH_PRIV1BBR7_PRIV1BB11           (0x1u<<11)
#define FLASH_PRIV1BBR7_PRIV1BB10           (0x1u<<10)
#define FLASH_PRIV1BBR7_PRIV1BB9            (0x1u<<9)
#define FLASH_PRIV1BBR7_PRIV1BB8            (0x1u<<8)
#define FLASH_PRIV1BBR7_PRIV1BB7            (0x1u<<7)
#define FLASH_PRIV1BBR7_PRIV1BB6            (0x1u<<6)
#define FLASH_PRIV1BBR7_PRIV1BB5            (0x1u<<5)
#define FLASH_PRIV1BBR7_PRIV1BB4            (0x1u<<4)
#define FLASH_PRIV1BBR7_PRIV1BB3            (0x1u<<3)
#define FLASH_PRIV1BBR7_PRIV1BB2            (0x1u<<2)
#define FLASH_PRIV1BBR7_PRIV1BB1            (0x1u<<1)
#define FLASH_PRIV1BBR7_PRIV1BB0            (0x1u<<0)

// PRIV1BBR8 Configuration

#define FLASH_PRIV1BBR8_PRIV1BB31           (0x1u<<31)
#define FLASH_PRIV1BBR8_PRIV1BB30           (0x1u<<30)
#define FLASH_PRIV1BBR8_PRIV1BB29           (0x1u<<29)
#define FLASH_PRIV1BBR8_PRIV1BB28           (0x1u<<28)
#define FLASH_PRIV1BBR8_PRIV1BB27           (0x1u<<27)
#define FLASH_PRIV1BBR8_PRIV1BB26           (0x1u<<26)
#define FLASH_PRIV1BBR8_PRIV1BB25           (0x1u<<25)
#define FLASH_PRIV1BBR8_PRIV1BB24           (0x1u<<24)
#define FLASH_PRIV1BBR8_PRIV1BB23           (0x1u<<23)
#define FLASH_PRIV1BBR8_PRIV1BB22           (0x1u<<22)
#define FLASH_PRIV1BBR8_PRIV1BB21           (0x1u<<21)
#define FLASH_PRIV1BBR8_PRIV1BB20           (0x1u<<20)
#define FLASH_PRIV1BBR8_PRIV1BB19           (0x1u<<19)
#define FLASH_PRIV1BBR8_PRIV1BB18           (0x1u<<18)
#define FLASH_PRIV1BBR8_PRIV1BB17           (0x1u<<17)
#define FLASH_PRIV1BBR8_PRIV1BB16           (0x1u<<16)
#define FLASH_PRIV1BBR8_PRIV1BB15           (0x1u<<15)
#define FLASH_PRIV1BBR8_PRIV1BB14           (0x1u<<14)
#define FLASH_PRIV1BBR8_PRIV1BB13           (0x1u<<13)
#define FLASH_PRIV1BBR8_PRIV1BB12           (0x1u<<12)
#define FLASH_PRIV1BBR8_PRIV1BB11           (0x1u<<11)
#define FLASH_PRIV1BBR8_PRIV1BB10           (0x1u<<10)
#define FLASH_PRIV1BBR8_PRIV1BB9            (0x1u<<9)
#define FLASH_PRIV1BBR8_PRIV1BB8            (0x1u<<8)
#define FLASH_PRIV1BBR8_PRIV1BB7            (0x1u<<7)
#define FLASH_PRIV1BBR8_PRIV1BB6            (0x1u<<6)
#define FLASH_PRIV1BBR8_PRIV1BB5            (0x1u<<5)
#define FLASH_PRIV1BBR8_PRIV1BB4            (0x1u<<4)
#define FLASH_PRIV1BBR8_PRIV1BB3            (0x1u<<3)
#define FLASH_PRIV1BBR8_PRIV1BB2            (0x1u<<2)
#define FLASH_PRIV1BBR8_PRIV1BB1            (0x1u<<1)
#define FLASH_PRIV1BBR8_PRIV1BB0            (0x1u<<0)

