Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_flash.h
// PRIV2BBR1 Configuration

#define FLASH_PRIV2BBR1_PRIV2BB31           (0x1u<<31)
#define FLASH_PRIV2BBR1_PRIV2BB30           (0x1u<<30)
#define FLASH_PRIV2BBR1_PRIV2BB29           (0x1u<<29)
#define FLASH_PRIV2BBR1_PRIV2BB28           (0x1u<<28)
#define FLASH_PRIV2BBR1_PRIV2BB27           (0x1u<<27)
#define FLASH_PRIV2BBR1_PRIV2BB26           (0x1u<<26)
#define FLASH_PRIV2BBR1_PRIV2BB25           (0x1u<<25)
#define FLASH_PRIV2BBR1_PRIV2BB24           (0x1u<<24)
#define FLASH_PRIV2BBR1_PRIV2BB23           (0x1u<<23)
#define FLASH_PRIV2BBR1_PRIV2BB22           (0x1u<<22)
#define FLASH_PRIV2BBR1_PRIV2BB21           (0x1u<<21)
#define FLASH_PRIV2BBR1_PRIV2BB20           (0x1u<<20)
#define FLASH_PRIV2BBR1_PRIV2BB19           (0x1u<<19)
#define FLASH_PRIV2BBR1_PRIV2BB18           (0x1u<<18)
#define FLASH_PRIV2BBR1_PRIV2BB17           (0x1u<<17)
#define FLASH_PRIV2BBR1_PRIV2BB16           (0x1u<<16)
#define FLASH_PRIV2BBR1_PRIV2BB15           (0x1u<<15)
#define FLASH_PRIV2BBR1_PRIV2BB14           (0x1u<<14)
#define FLASH_PRIV2BBR1_PRIV2BB13           (0x1u<<13)
#define FLASH_PRIV2BBR1_PRIV2BB12           (0x1u<<12)
#define FLASH_PRIV2BBR1_PRIV2BB11           (0x1u<<11)
#define FLASH_PRIV2BBR1_PRIV2BB10           (0x1u<<10)
#define FLASH_PRIV2BBR1_PRIV2BB9            (0x1u<<9)
#define FLASH_PRIV2BBR1_PRIV2BB8            (0x1u<<8)
#define FLASH_PRIV2BBR1_PRIV2BB7            (0x1u<<7)
#define FLASH_PRIV2BBR1_PRIV2BB6            (0x1u<<6)
#define FLASH_PRIV2BBR1_PRIV2BB5            (0x1u<<5)
#define FLASH_PRIV2BBR1_PRIV2BB4            (0x1u<<4)
#define FLASH_PRIV2BBR1_PRIV2BB3            (0x1u<<3)
#define FLASH_PRIV2BBR1_PRIV2BB2            (0x1u<<2)
#define FLASH_PRIV2BBR1_PRIV2BB1            (0x1u<<1)
#define FLASH_PRIV2BBR1_PRIV2BB0            (0x1u<<0)

// PRIV2BBR2 Configuration

#define FLASH_PRIV2BBR2_PRIV2BB31           (0x1u<<31)
#define FLASH_PRIV2BBR2_PRIV2BB30           (0x1u<<30)
#define FLASH_PRIV2BBR2_PRIV2BB29           (0x1u<<29)
#define FLASH_PRIV2BBR2_PRIV2BB28           (0x1u<<28)
#define FLASH_PRIV2BBR2_PRIV2BB27           (0x1u<<27)
#define FLASH_PRIV2BBR2_PRIV2BB26           (0x1u<<26)
#define FLASH_PRIV2BBR2_PRIV2BB25           (0x1u<<25)
#define FLASH_PRIV2BBR2_PRIV2BB24           (0x1u<<24)
#define FLASH_PRIV2BBR2_PRIV2BB23           (0x1u<<23)
#define FLASH_PRIV2BBR2_PRIV2BB22           (0x1u<<22)
#define FLASH_PRIV2BBR2_PRIV2BB21           (0x1u<<21)
#define FLASH_PRIV2BBR2_PRIV2BB20           (0x1u<<20)
#define FLASH_PRIV2BBR2_PRIV2BB19           (0x1u<<19)
#define FLASH_PRIV2BBR2_PRIV2BB18           (0x1u<<18)
#define FLASH_PRIV2BBR2_PRIV2BB17           (0x1u<<17)
#define FLASH_PRIV2BBR2_PRIV2BB16           (0x1u<<16)
#define FLASH_PRIV2BBR2_PRIV2BB15           (0x1u<<15)
#define FLASH_PRIV2BBR2_PRIV2BB14           (0x1u<<14)
#define FLASH_PRIV2BBR2_PRIV2BB13           (0x1u<<13)
#define FLASH_PRIV2BBR2_PRIV2BB12           (0x1u<<12)
#define FLASH_PRIV2BBR2_PRIV2BB11           (0x1u<<11)
#define FLASH_PRIV2BBR2_PRIV2BB10           (0x1u<<10)
#define FLASH_PRIV2BBR2_PRIV2BB9            (0x1u<<9)
#define FLASH_PRIV2BBR2_PRIV2BB8            (0x1u<<8)
#define FLASH_PRIV2BBR2_PRIV2BB7            (0x1u<<7)
#define FLASH_PRIV2BBR2_PRIV2BB6            (0x1u<<6)
#define FLASH_PRIV2BBR2_PRIV2BB5            (0x1u<<5)
#define FLASH_PRIV2BBR2_PRIV2BB4            (0x1u<<4)
#define FLASH_PRIV2BBR2_PRIV2BB3            (0x1u<<3)
#define FLASH_PRIV2BBR2_PRIV2BB2            (0x1u<<2)
#define FLASH_PRIV2BBR2_PRIV2BB1            (0x1u<<1)
#define FLASH_PRIV2BBR2_PRIV2BB0            (0x1u<<0)

// PRIV2BBR3 Configuration

#define FLASH_PRIV2BBR3_PRIV2BB31           (0x1u<<31)
#define FLASH_PRIV2BBR3_PRIV2BB30           (0x1u<<30)
#define FLASH_PRIV2BBR3_PRIV2BB29           (0x1u<<29)
#define FLASH_PRIV2BBR3_PRIV2BB28           (0x1u<<28)
#define FLASH_PRIV2BBR3_PRIV2BB27           (0x1u<<27)
#define FLASH_PRIV2BBR3_PRIV2BB26           (0x1u<<26)
#define FLASH_PRIV2BBR3_PRIV2BB25           (0x1u<<25)
#define FLASH_PRIV2BBR3_PRIV2BB24           (0x1u<<24)
#define FLASH_PRIV2BBR3_PRIV2BB23           (0x1u<<23)
#define FLASH_PRIV2BBR3_PRIV2BB22           (0x1u<<22)
#define FLASH_PRIV2BBR3_PRIV2BB21           (0x1u<<21)
#define FLASH_PRIV2BBR3_PRIV2BB20           (0x1u<<20)
#define FLASH_PRIV2BBR3_PRIV2BB19           (0x1u<<19)
#define FLASH_PRIV2BBR3_PRIV2BB18           (0x1u<<18)
#define FLASH_PRIV2BBR3_PRIV2BB17           (0x1u<<17)
#define FLASH_PRIV2BBR3_PRIV2BB16           (0x1u<<16)
#define FLASH_PRIV2BBR3_PRIV2BB15           (0x1u<<15)
#define FLASH_PRIV2BBR3_PRIV2BB14           (0x1u<<14)
#define FLASH_PRIV2BBR3_PRIV2BB13           (0x1u<<13)
#define FLASH_PRIV2BBR3_PRIV2BB12           (0x1u<<12)
#define FLASH_PRIV2BBR3_PRIV2BB11           (0x1u<<11)
#define FLASH_PRIV2BBR3_PRIV2BB10           (0x1u<<10)
#define FLASH_PRIV2BBR3_PRIV2BB9            (0x1u<<9)
#define FLASH_PRIV2BBR3_PRIV2BB8            (0x1u<<8)
#define FLASH_PRIV2BBR3_PRIV2BB7            (0x1u<<7)
#define FLASH_PRIV2BBR3_PRIV2BB6            (0x1u<<6)
#define FLASH_PRIV2BBR3_PRIV2BB5            (0x1u<<5)
#define FLASH_PRIV2BBR3_PRIV2BB4            (0x1u<<4)
#define FLASH_PRIV2BBR3_PRIV2BB3            (0x1u<<3)
#define FLASH_PRIV2BBR3_PRIV2BB2            (0x1u<<2)
#define FLASH_PRIV2BBR3_PRIV2BB1            (0x1u<<1)
#define FLASH_PRIV2BBR3_PRIV2BB0            (0x1u<<0)

// PRIV2BBR4 Configuration

#define FLASH_PRIV2BBR4_PRIV2BB31           (0x1u<<31)
#define FLASH_PRIV2BBR4_PRIV2BB30           (0x1u<<30)
#define FLASH_PRIV2BBR4_PRIV2BB29           (0x1u<<29)
#define FLASH_PRIV2BBR4_PRIV2BB28           (0x1u<<28)
#define FLASH_PRIV2BBR4_PRIV2BB27           (0x1u<<27)
#define FLASH_PRIV2BBR4_PRIV2BB26           (0x1u<<26)
#define FLASH_PRIV2BBR4_PRIV2BB25           (0x1u<<25)
#define FLASH_PRIV2BBR4_PRIV2BB24           (0x1u<<24)
#define FLASH_PRIV2BBR4_PRIV2BB23           (0x1u<<23)
#define FLASH_PRIV2BBR4_PRIV2BB22           (0x1u<<22)
#define FLASH_PRIV2BBR4_PRIV2BB21           (0x1u<<21)
#define FLASH_PRIV2BBR4_PRIV2BB20           (0x1u<<20)
#define FLASH_PRIV2BBR4_PRIV2BB19           (0x1u<<19)
#define FLASH_PRIV2BBR4_PRIV2BB18           (0x1u<<18)
#define FLASH_PRIV2BBR4_PRIV2BB17           (0x1u<<17)
#define FLASH_PRIV2BBR4_PRIV2BB16           (0x1u<<16)
#define FLASH_PRIV2BBR4_PRIV2BB15           (0x1u<<15)
#define FLASH_PRIV2BBR4_PRIV2BB14           (0x1u<<14)
#define FLASH_PRIV2BBR4_PRIV2BB13           (0x1u<<13)
#define FLASH_PRIV2BBR4_PRIV2BB12           (0x1u<<12)
#define FLASH_PRIV2BBR4_PRIV2BB11           (0x1u<<11)
#define FLASH_PRIV2BBR4_PRIV2BB10           (0x1u<<10)
#define FLASH_PRIV2BBR4_PRIV2BB9            (0x1u<<9)
#define FLASH_PRIV2BBR4_PRIV2BB8            (0x1u<<8)
#define FLASH_PRIV2BBR4_PRIV2BB7            (0x1u<<7)
#define FLASH_PRIV2BBR4_PRIV2BB6            (0x1u<<6)
#define FLASH_PRIV2BBR4_PRIV2BB5            (0x1u<<5)
#define FLASH_PRIV2BBR4_PRIV2BB4            (0x1u<<4)
#define FLASH_PRIV2BBR4_PRIV2BB3            (0x1u<<3)
#define FLASH_PRIV2BBR4_PRIV2BB2            (0x1u<<2)
#define FLASH_PRIV2BBR4_PRIV2BB1            (0x1u<<1)
#define FLASH_PRIV2BBR4_PRIV2BB0            (0x1u<<0)

// PRIV2BBR5 Configuration

